        {
                
                "date": "03/21/2024 14:47:59 AUS Eastern Daylight Time",
                "tenant_details": [
  {
    "DomainName": "sdablueprinthybriddev.onmicrosoft.com",
    "TenantId": "21f12302-fa43-4a63-a360-d5385c8e4910",
    "AADAdditionalData": {
      "AssignedPlans": [
        {
          "AssignedDateTime": "2024-01-22T00:55:56Z",
          "CapabilityStatus": "Enabled",
          "Service": "ProcessSimple",
          "ServicePlanId": "50e68c76-46c6-4674-81f9-75456511b170"
        },
        {
          "AssignedDateTime": "2024-01-22T00:55:56Z",
          "CapabilityStatus": "Enabled",
          "Service": "CRM",
          "ServicePlanId": "17ab22cd-a0b3-4536-910a-cb6eb12696c0"
        },
        {
          "AssignedDateTime": "2023-11-29T14:55:56Z",
          "CapabilityStatus": "Enabled",
          "Service": "Microsoft.ProjectBabylon",
          "ServicePlanId": "c948ea65-2053-4a5a-8a62-9eaaaf11b522"
        },
        {
          "AssignedDateTime": "2023-11-29T14:55:56Z",
          "CapabilityStatus": "Enabled",
          "Service": "DefenderforIoT",
          "ServicePlanId": "99cd49a9-0e54-4e07-aea1-d8d9f5f704f5"
        },
        {
          "AssignedDateTime": "2023-10-19T15:00:38Z",
          "CapabilityStatus": "Enabled",
          "Service": "MixedRealityCollaborationServices",
          "ServicePlanId": "dcf9d2f4-772e-4434-b757-77a453cfbc02"
        },
        {
          "AssignedDateTime": "2023-10-19T15:00:38Z",
          "CapabilityStatus": "Enabled",
          "Service": "Chapter5FluidApp",
          "ServicePlanId": "c4b8c31a-fb44-4c65-9837-a21f55fcabda"
        },
        {
          "AssignedDateTime": "2023-10-19T15:00:38Z",
          "CapabilityStatus": "Enabled",
          "Service": "CustomerLockbox",
          "ServicePlanId": "3ec18638-bd4c-4d3b-8905-479ed636b83e"
        },
        {
          "AssignedDateTime": "2023-10-19T15:00:38Z",
          "CapabilityStatus": "Enabled",
          "Service": "MixedRealityCollaborationServices",
          "ServicePlanId": "3efbd4ed-8958-4824-8389-1321f8730af8"
        },
        {
          "AssignedDateTime": "2023-09-19T15:02:04Z",
          "CapabilityStatus": "Enabled",
          "Service": "Bing",
          "ServicePlanId": "0d0c0d31-fae7-41f2-b909-eaf4d7f26dba"
        },
        {
          "AssignedDateTime": "2023-08-31T04:12:31Z",
          "CapabilityStatus": "Enabled",
          "Service": "SharePoint",
          "ServicePlanId": "a1ace008-72f3-4ea0-8dac-33b3a23a2472"
        },
        {
          "AssignedDateTime": "2023-07-25T01:00:58Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "113feb6c-3fe4-4440-bddc-54d774bf0318"
        },
        {
          "AssignedDateTime": "2023-07-25T01:00:58Z",
          "CapabilityStatus": "Enabled",
          "Service": "RMSOnline",
          "ServicePlanId": "31cf2cfc-6b0d-4adc-a336-88b724ed8122"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "CRM",
          "ServicePlanId": "afa73018-811e-46e9-988f-f75d2b1b8430"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "PowerAppsService",
          "ServicePlanId": "9c0dab89-a30c-4117-86e7-97bda240acd2"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:35Z",
          "CapabilityStatus": "Enabled",
          "Service": "Adallom",
          "ServicePlanId": "8c098270-9dd4-4350-9b30-ba4703f3b36b"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "e26c2fcc-ab91-4a61-b35c-03cdc8dddf66"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "b1188c4c-1b36-4018-b48b-ee07604f6feb"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "AADPremiumService",
          "ServicePlanId": "41781fb2-bc02-4b7c-bd55-b576c07bb09d"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "MicrosoftKaizala",
          "ServicePlanId": "0898bdbb-73b0-471a-81e5-20f1fe4dd66e"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "ProcessSimple",
          "ServicePlanId": "07699545-9485-468e-95b6-2fca3738be01"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "ccibotsprod",
          "ServicePlanId": "ded3d325-1bdc-453e-8432-5bac26d7a014"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:35Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "9f431833-0334-42de-a7dc-70aa40db46db"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "CRM",
          "ServicePlanId": "28b0fa46-c39a-4188-89e2-58e979a6b014"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "6db1f1db-2b46-403f-be40-e39395f08dbb"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "ProjectProgramsAndPortfolios",
          "ServicePlanId": "b21a6b06-1988-436e-a07b-51ec6d9f52ad"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "RMSOnline",
          "ServicePlanId": "6c57d4b6-3b23-47a5-9bc9-69f17b4947b3"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "MicrosoftOffice",
          "ServicePlanId": "531ee2f8-b1cb-453b-9c21-d2180d014ca5"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "SharePoint",
          "ServicePlanId": "e95bec33-7c88-4a70-8e19-b10bd9d0c014"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "SharePoint",
          "ServicePlanId": "5dbe027f-2339-4123-9542-606e4d348a72"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "AADPremiumService",
          "ServicePlanId": "eec0eb4f-6444-4f95-aba0-50c24d67f998"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "f6de4823-28fa-440b-b886-4783fa86ddba"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:35Z",
          "CapabilityStatus": "Deleted",
          "Service": "SCO",
          "ServicePlanId": "882e1d05-acd1-4ccb-8708-6ee03664b117"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "33c4f319-9bdd-48d6-9c4d-410b750a4a5a"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "YammerEnterprise",
          "ServicePlanId": "a82fbf69-b4d7-49f4-83a6-915b2cf354f4"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "199a5c09-e0ca-4e37-8f7c-b05d533e1ea2"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "M365LabelAnalytics",
          "ServicePlanId": "d9fa6af4-e046-4c89-9226-729a0786685d"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "MicrosoftEndpointDLP",
          "ServicePlanId": "64bfac92-2b17-4482-b5e5-a0304429de3e"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:35Z",
          "CapabilityStatus": "Enabled",
          "Service": "MicrosoftCommunicationsOnline",
          "ServicePlanId": "4828c8ec-dc2e-4779-b502-87ac9ce28ab7"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "9d0c4ee5-e4a1-4625-ab39-d82b619b1a34"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "MicrosoftCommunicationsOnline",
          "ServicePlanId": "3e26ee1f-8a5f-4d52-aee2-b81ce45c8f40"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:35Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "34c0d7a0-a70f-4668-9238-47f9fc208882"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "MultiFactorService",
          "ServicePlanId": "8a256a2b-b617-496d-b51b-e76466e88db0"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "MicrosoftPrint",
          "ServicePlanId": "795f6fe0-cc4d-4773-b050-5dde4dc704c9"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "M365Multi-TenantManagement",
          "ServicePlanId": "6f23d6a9-adbf-481c-8538-b4c095654487"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "TeamspaceAPI",
          "ServicePlanId": "57ff2da0-773e-42df-b2af-ffb7a2317929"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:35Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "4de31727-a228-4ec3-a5bf-8e45b5ca48cc"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "d2d51368-76c9-4317-ada2-a12c004c432f"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "RMSOnline",
          "ServicePlanId": "5689bec4-755d-4753-8b61-40975025187c"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "617b097b-4b93-4ede-83de-5f075bb5fb2f"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "Sway",
          "ServicePlanId": "a23b959c-7ce8-4e57-9140-b90eb88a9e97"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:35Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "f20fedf3-f3c3-43c3-8267-2bfdd51c0939"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "SharePoint",
          "ServicePlanId": "db4d623d-b514-490b-b7ef-8885eee514de"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "To-Do",
          "ServicePlanId": "3fb82609-8c27-4f7b-bd51-30634711ee67"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "a6520331-d7d4-4276-95f5-15c0933bc757"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "MIPExchangeSolutions",
          "ServicePlanId": "cd31b152-6326-4d1b-ae1b-997b625182e6"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "46129a58-a698-46f0-aa5b-17f6586297d9"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "AzureAdvancedThreatAnalytics",
          "ServicePlanId": "14ab5db5-e6c4-4b20-b4bc-13e36fd2227f"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "Deskless",
          "ServicePlanId": "8c7d2df8-86f0-4902-b2ed-a0458298f3b3"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "LearningAppServiceInTeams",
          "ServicePlanId": "b76fb638-6ba6-402a-b9f9-83d28acb3d86"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "RMSOnline",
          "ServicePlanId": "bea4c11e-220a-4e6d-8eb8-8ea15d019f90"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "MicrosoftCommunicationsOnline",
          "ServicePlanId": "0feaeb32-d00e-4d66-bd5a-43b5b83db82c"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:35Z",
          "CapabilityStatus": "Enabled",
          "Service": "PowerBI",
          "ServicePlanId": "70d33638-9c74-4d01-bfd3-562de28bd4ba"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "8e0c0a52-6a6c-4d40-8370-dd62790dcd70"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "bf6f5520-59e3-4f82-974b-7dbbc4fd27c7"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "WindowsDefenderATP",
          "ServicePlanId": "871d91ec-ec1a-452b-a83f-bd76c7d770ef"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "YammerEnterprise",
          "ServicePlanId": "7547a3fe-08ee-4ccb-b430-5077c5041653"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "c4801e8a-cb58-4c35-aca6-f2dcc106f287"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "5136a095-5cf0-4aff-bec3-e84448b38ea5"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "M365CommunicationCompliance",
          "ServicePlanId": "a413a9ff-720c-4822-98ef-2f37c2a21f4c"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "OfficeForms",
          "ServicePlanId": "e212cbc7-0961-4c40-9825-01117710dcb1"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "M365LabelAnalytics",
          "ServicePlanId": "2b815d45-56e4-4e3a-b65c-66cb9175b560"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "Bing",
          "ServicePlanId": "94065c59-bc8e-4e8b-89e5-5138d471eaff"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "SCO",
          "ServicePlanId": "c1ec4a95-1f05-45b3-a911-aa3fa01094f5"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "65cc641f-cccd-4643-97e0-a17e3045e541"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "Office365InsiderRisk",
          "ServicePlanId": "d587c7a3-bda9-4f99-8776-9bcf59c84f75"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:35Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "efb87545-963c-4e0d-99df-69c6916d9eb0"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "Modern-Workplace-Core-ITaas",
          "ServicePlanId": "9a6eeb79-0b4b-4bf0-9808-39d99a2cd5a3"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "MicrosoftThreatProtection",
          "ServicePlanId": "bf28f719-7844-4079-9c78-c1307898e192"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:32Z",
          "CapabilityStatus": "Enabled",
          "Service": "WindowsUpdateforBusinessCloudExtensions",
          "ServicePlanId": "7bf960f6-2cd9-443a-8046-5dbff9558365"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "Adallom",
          "ServicePlanId": "2e2ddb96-6af9-4b1d-a3f0-d6ecfd22edb2"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "2f442157-a11c-46b9-ae5b-6e39ff4e5849"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "MicrosoftStream",
          "ServicePlanId": "6c6042f5-6f01-4d67-b8c1-eb99d36eed3e"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "41fcdd7d-4733-4863-9cf4-c65b83ce2df4"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "WhiteboardServices",
          "ServicePlanId": "4a51bca5-1eff-43f5-878c-177680f191af"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "Windows",
          "ServicePlanId": "21b439ba-a0ca-424f-a6cc-52f954a5b111"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "MicrosoftOffice",
          "ServicePlanId": "43de0ff5-c92c-492b-9116-175376d08c38"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "efb0351d-3b08-4503-993d-383af8de41e3"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:34Z",
          "CapabilityStatus": "Enabled",
          "Service": "ProjectWorkManagement",
          "ServicePlanId": "b737dad2-2f6c-4c65-90e3-ca563267e8b9"
        },
        {
          "AssignedDateTime": "2023-07-20T04:20:33Z",
          "CapabilityStatus": "Enabled",
          "Service": "exchange",
          "ServicePlanId": "6dc145d6-95dd-4191-b9c3-185575ee6f6b"
        }
      ],
      "Branding": {
        "BackgroundColor": null,
        "BackgroundImage": null,
        "BackgroundImageRelativeUrl": null,
        "BannerLogo": null,
        "BannerLogoRelativeUrl": null,
        "CdnList": null,
        "ContentCustomization": {
          "AttributeCollection": null,
          "AttributeCollectionRelativeUrl": null
        },
        "CustomAccountResetCredentialsUrl": null,
        "CustomCannotAccessYourAccountText": null,
        "CustomCannotAccessYourAccountUrl": null,
        "CustomCss": null,
        "CustomCssRelativeUrl": null,
        "CustomForgotMyPasswordText": null,
        "CustomPrivacyAndCookiesText": null,
        "CustomPrivacyAndCookiesUrl": null,
        "CustomResetItNowText": null,
        "CustomTermsOfUseText": null,
        "CustomTermsOfUseUrl": null,
        "Favicon": null,
        "FaviconRelativeUrl": null,
        "HeaderBackgroundColor": null,
        "HeaderLogo": null,
        "HeaderLogoRelativeUrl": null,
        "Id": null,
        "Localizations": null,
        "LoginPageLayoutConfiguration": {
          "IsFooterShown": null,
          "IsHeaderShown": null,
          "LayoutTemplateType": null
        },
        "LoginPageTextVisibilitySettings": {
          "HideAccountResetCredentials": null,
          "HideCannotAccessYourAccount": null,
          "HideForgotMyPassword": null,
          "HidePrivacyAndCookies": null,
          "HideResetItNow": null,
          "HideTermsOfUse": null
        },
        "SignInPageText": null,
        "SquareLogo": null,
        "SquareLogoDark": null,
        "SquareLogoDarkRelativeUrl": null,
        "SquareLogoRelativeUrl": null,
        "UsernameHintText": null
      },
      "BusinessPhones": [
        "0251300149"
      ],
      "CertificateBasedAuthConfiguration": null,
      "CertificateConnectorSetting": {
        "CertExpiryTime": null,
        "ConnectorVersion": null,
        "EnrollmentError": null,
        "LastConnectorConnectionTime": null,
        "LastUploadVersion": null,
        "Status": null
      },
      "City": "Canberra",
      "Country": null,
      "CountryLetterCode": "AU",
      "CreatedDateTime": "2023-07-20T04:20:21Z",
      "DefaultUsageLocation": null,
      "DeletedDateTime": null,
      "DirectorySizeQuota": {
        "Total": 50000,
        "Used": 484
      },
      "DisplayName": "Australian Signals Directorate - Blueprint Hybrid Dev",
      "Extensions": null,
      "Id": "21f12302-fa43-4a63-a360-d5385c8e4910",
      "IsMultipleDataLocationsForServicesEnabled": null,
      "MarketingNotificationEmails": [],
      "MobileDeviceManagementAuthority": {},
      "OnPremisesLastPasswordSyncDateTime": "2023-11-09T05:35:12Z",
      "OnPremisesLastSyncDateTime": "2023-11-09T05:29:18Z",
      "OnPremisesSyncEnabled": true,
      "PartnerInformation": {
        "CommerceUrl": null,
        "CompanyName": null,
        "CompanyType": null,
        "HelpUrl": null,
        "PartnerTenantId": null,
        "SupportEmails": null,
        "SupportTelephones": null,
        "SupportUrl": null
      },
      "PartnerTenantType": null,
      "PostalCode": "2600",
      "PreferredLanguage": "en",
      "PrivacyProfile": {
        "ContactEmail": "privacy@sdablueprinthybriddev.onmicrosoft.com",
        "StatementUrl": "https://www.dta.gov.au/privacy-policy-summary"
      },
      "ProvisionedPlans": [
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "SharePoint"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "RMSOnline"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "SCO"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "SharePoint"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "SharePoint"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "SharePoint"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "MicrosoftCommunicationsOnline"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "MicrosoftCommunicationsOnline"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "MicrosoftCommunicationsOnline"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "Adallom"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "Adallom"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "RMSOnline"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "RMSOnline"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "RMSOnline"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "ProjectWorkManagement"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "YammerEnterprise"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "MicrosoftCommunicationsOnline"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "MicrosoftCommunicationsOnline"
        },
        {
          "CapabilityStatus": "Enabled",
          "ProvisioningStatus": "Success",
          "Service": "exchange"
        }
      ],
      "SecurityComplianceNotificationMails": [],
      "SecurityComplianceNotificationPhones": [],
      "Settings": {
        "ContactInsights": {
          "DisabledForGroup": null,
          "Id": null,
          "IsEnabledInOrganization": null
        },
        "Id": null,
        "ItemInsights": {
          "DisabledForGroup": null,
          "Id": null,
          "IsEnabledInOrganization": null
        },
        "MicrosoftApplicationDataAccess": {
          "DisabledForGroup": null,
          "Id": null,
          "IsEnabledForAllMicrosoftApplications": null
        },
        "PeopleInsights": {
          "DisabledForGroup": null,
          "Id": null,
          "IsEnabledInOrganization": null
        }
      },
      "State": "australian capital territory",
      "Street": "14 Brindabella Cct",
      "TechnicalNotificationMails": [
        "joel.ramsay@asd.gov.au"
      ],
      "VerifiedDomains": [
        {
          "Capabilities": "Email, OfficeCommunicationsOnline",
          "IsDefault": true,
          "IsInitial": true,
          "Name": "sdablueprinthybriddev.onmicrosoft.com",
          "Type": "Managed"
        },
        {
          "Capabilities": "None",
          "IsDefault": false,
          "IsInitial": false,
          "Name": "sdablueprinthybriddev.mail.onmicrosoft.com",
          "Type": "Managed"
        }
      ],
      "AdditionalProperties": {
        "tenantType": "AAD",
        "onPremisesSyncStatus": [
          "System.Collections.Generic.Dictionary`2[System.String,System.Object]"
        ]
      }
    },
    "DisplayName": "Australian Signals Directorate - Blueprint Hybrid Dev"
  }
],
                "BASE_config": null,
                "blueprint_version": "1",
                "module_version": "0.1.0",

                    "user_settings_default_permissions" : [
  {
    "AllowEmailVerifiedUsersToJoinOrganization": true,
    "AllowInvitesFrom": "none",
    "AllowUserConsentForRiskyApps": null,
    "AllowedToSignUpEmailBasedSubscriptions": true,
    "AllowedToUseSspr": true,
    "BlockMsolPowerShell": false,
    "DefaultUserRoleOverrides": null,
    "DefaultUserRolePermissions": {
      "AllowedToCreateApps": false,
      "AllowedToCreateSecurityGroups": false,
      "AllowedToCreateTenants": false,
      "AllowedToReadBitlockerKeysForOwnedDevice": true,
      "AllowedToReadOtherUsers": true
    },
    "DeletedDateTime": null,
    "Description": "Used to manage authorization related settings across the company.",
    "DisplayName": "Authorization Policy",
    "EnabledPreviewFeatures": [],
    "GuestUserRoleId": "2af84b1e-32c8-42b7-82bc-daa82404023b",
    "Id": "authorizationPolicy",
    "PermissionGrantPolicyIdsAssignedToDefaultUserRole": [
      "ManagePermissionGrantsForOwnedResource.microsoft-dynamically-managed-permissions-for-team",
      "ManagePermissionGrantsForOwnedResource.microsoft-dynamically-managed-permissions-for-chat"
    ]
  }
],
    "authentication_flow_policy" : [
  {
    "Description": "Authentication flows policy allows modification of settings related to authentication flows in AAD tenant, such as self-service sign up configuration.",
    "DisplayName": "Authentication flows policy",
    "Id": "authenticationFlowsPolicy",
    "SelfServiceSignUp": {
      "IsEnabled": false
    }
  }
],
    "external_identity_policy" : [
  {
    "AllowDeletedIdentitiesDataRemoval": false,
    "AllowExternalIdentitiesToLeave": true,
    "DeletedDateTime": null,
    "Description": null,
    "DisplayName": "External Identities Policy",
    "Id": "externalIdentityPolicy"
  }
],
    "group_lifecycle_policy" : [
  {
    "AlternateNotificationEmails": "Office365_Group_Expiration@agency.gov.au",
    "GroupLifetimeInDays": 180,
    "Id": "fb77ffc5-7172-467f-b60d-0845f7925a66",
    "ManagedGroupTypes": "All"
  }
],
    "group_settings" : [
  {
    "Name": "NewUnifiedGroupWritebackDefault",
    "Value": "true"
  },
  {
    "Name": "EnableMIPLabels",
    "Value": "True"
  },
  {
    "Name": "CustomBlockedWordsList",
    "Value": "HR,Exec,SOC,Minister"
  },
  {
    "Name": "EnableMSStandardBlockedWords",
    "Value": "false"
  },
  {
    "Name": "ClassificationDescriptions",
    "Value": ""
  },
  {
    "Name": "DefaultClassification",
    "Value": ""
  },
  {
    "Name": "PrefixSuffixNamingRequirement",
    "Value": ""
  },
  {
    "Name": "AllowGuestsToBeGroupOwner",
    "Value": "false"
  },
  {
    "Name": "AllowGuestsToAccessGroups",
    "Value": "False"
  },
  {
    "Name": "GuestUsageGuidelinesUrl",
    "Value": ""
  },
  {
    "Name": "GroupCreationAllowedGroupId",
    "Value": "edf4cc97-0a54-4b86-9338-1411639370a9"
  },
  {
    "Name": "AllowToAddGuests",
    "Value": "False"
  },
  {
    "Name": "UsageGuidelinesUrl",
    "Value": ""
  },
  {
    "Name": "ClassificationList",
    "Value": ""
  },
  {
    "Name": "EnableGroupCreation",
    "Value": "False"
  }
],
    "authentication_strength_policy" : [
  {
    "AllowedCombinations": [
      "windowsHelloForBusiness",
      "fido2",
      "temporaryAccessPassOneTime",
      "temporaryAccessPassMultiUse",
      "password,hardwareOath"
    ],
    "CombinationConfigurations": [],
    "CreatedDateTime": "2024-01-31T01:11:19.1946766Z",
    "Description": "",
    "DisplayName": "Legacy Methods",
    "Id": "e15045c6-45cf-447d-93e8-eb5320d8ad3c",
    "ModifiedDateTime": "2024-01-31T01:11:19.1946766Z",
    "PolicyType": "custom",
    "RequirementsSatisfied": "mfa",
    "AdditionalProperties": {
      "combinationConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#policies/authenticationStrengthPolicies('e15045c6-45cf-447d-93e8-eb5320d8ad3c')/combinationConfigurations"
    }
  },
  {
    "AllowedCombinations": [
      "fido2"
    ],
    "CombinationConfigurations": [],
    "CreatedDateTime": "2024-01-31T01:12:04.5471525Z",
    "Description": "",
    "DisplayName": "Accredited Strong",
    "Id": "7afaa972-dec0-4804-b68b-d47dd3d7201f",
    "ModifiedDateTime": "2024-01-31T01:12:04.5491535Z",
    "PolicyType": "custom",
    "RequirementsSatisfied": "mfa",
    "AdditionalProperties": {
      "combinationConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#policies/authenticationStrengthPolicies('7afaa972-dec0-4804-b68b-d47dd3d7201f')/combinationConfigurations"
    }
  },
  {
    "AllowedCombinations": [
      "windowsHelloForBusiness",
      "fido2",
      "temporaryAccessPassOneTime",
      "temporaryAccessPassMultiUse",
      "password,softwareOath",
      "password,hardwareOath"
    ],
    "CombinationConfigurations": [],
    "CreatedDateTime": "2024-01-31T01:12:56.1659789Z",
    "Description": "",
    "DisplayName": "Soft Tokens",
    "Id": "4108ff0d-e821-4dc7-a374-c493cd00507c",
    "ModifiedDateTime": "2024-01-31T01:12:56.1659789Z",
    "PolicyType": "custom",
    "RequirementsSatisfied": "mfa",
    "AdditionalProperties": {
      "combinationConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#policies/authenticationStrengthPolicies('4108ff0d-e821-4dc7-a374-c493cd00507c')/combinationConfigurations"
    }
  },
  {
    "AllowedCombinations": [
      "windowsHelloForBusiness",
      "fido2",
      "x509CertificateMultiFactor",
      "deviceBasedPush",
      "temporaryAccessPassOneTime",
      "temporaryAccessPassMultiUse",
      "password,microsoftAuthenticatorPush",
      "password,softwareOath",
      "password,hardwareOath",
      "password,sms",
      "password,voice",
      "federatedMultiFactor",
      "microsoftAuthenticatorPush,federatedSingleFactor",
      "softwareOath,federatedSingleFactor",
      "hardwareOath,federatedSingleFactor",
      "sms,federatedSingleFactor",
      "voice,federatedSingleFactor"
    ],
    "CombinationConfigurations": [],
    "CreatedDateTime": "2021-12-01T00:00:00Z",
    "Description": "Combinations of methods that satisfy strong authentication, such as a password + SMS",
    "DisplayName": "Multifactor authentication",
    "Id": "00000000-0000-0000-0000-000000000002",
    "ModifiedDateTime": "2021-12-01T00:00:00Z",
    "PolicyType": "builtIn",
    "RequirementsSatisfied": "mfa",
    "AdditionalProperties": {
      "combinationConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#policies/authenticationStrengthPolicies('00000000-0000-0000-0000-000000000002')/combinationConfigurations"
    }
  },
  {
    "AllowedCombinations": [
      "windowsHelloForBusiness",
      "fido2",
      "x509CertificateMultiFactor",
      "deviceBasedPush"
    ],
    "CombinationConfigurations": [],
    "CreatedDateTime": "2021-12-01T00:00:00Z",
    "Description": "Passwordless methods that satisfy strong authentication, such as Passwordless sign-in with the Microsoft Authenticator",
    "DisplayName": "Passwordless MFA",
    "Id": "00000000-0000-0000-0000-000000000003",
    "ModifiedDateTime": "2021-12-01T00:00:00Z",
    "PolicyType": "builtIn",
    "RequirementsSatisfied": "mfa",
    "AdditionalProperties": {
      "combinationConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#policies/authenticationStrengthPolicies('00000000-0000-0000-0000-000000000003')/combinationConfigurations"
    }
  },
  {
    "AllowedCombinations": [
      "windowsHelloForBusiness",
      "fido2",
      "x509CertificateMultiFactor"
    ],
    "CombinationConfigurations": [],
    "CreatedDateTime": "2021-12-01T00:00:00Z",
    "Description": "Phishing-resistant, Passwordless methods for the strongest authentication, such as a FIDO2 security key",
    "DisplayName": "Phishing-resistant MFA",
    "Id": "00000000-0000-0000-0000-000000000004",
    "ModifiedDateTime": "2021-12-01T00:00:00Z",
    "PolicyType": "builtIn",
    "RequirementsSatisfied": "mfa",
    "AdditionalProperties": {
      "combinationConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#policies/authenticationStrengthPolicies('00000000-0000-0000-0000-000000000004')/combinationConfigurations"
    }
  }
],
    "security_defaults" : [
  {
    "DeletedDateTime": null,
    "Description": "Security defaults is a set of basic identity security mechanisms recommended by Microsoft. When enabled, these recommendations will be automatically enforced in your organization. Administrators and users will be better protected from common identity related attacks.",
    "DisplayName": "Security Defaults",
    "Id": "00000000-0000-0000-0000-000000000005",
    "IsEnabled": false
  }
],
    "user" : [
  {
    "AboutMe": null,
    "AccountEnabled": false,
    "Activities": null,
    "AgeGroup": null,
    "AgreementAcceptances": null,
    "Analytics": {
      "ActivityStatistics": null,
      "Id": null,
      "Settings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSettings"
    },
    "AppConsentRequestsForApproval": null,
    "AppRoleAssignedResources": null,
    "AppRoleAssignments": null,
    "Approvals": null,
    "AssignedLicenses": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedLicense"
    ],
    "AssignedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan"
    ],
    "Authentication": {
      "EmailMethods": null,
      "Fido2Methods": null,
      "Id": null,
      "Methods": null,
      "MicrosoftAuthenticatorMethods": null,
      "Operations": null,
      "PasswordMethods": null,
      "PasswordlessMicrosoftAuthenticatorMethods": null,
      "PhoneMethods": null,
      "PlatformCredentialMethods": null,
      "SignInPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSignInPreferences",
      "SoftwareOathMethods": null,
      "TemporaryAccessPassMethods": null,
      "WindowsHelloForBusinessMethods": null
    },
    "AuthorizationInfo": {
      "CertificateUserIds": ""
    },
    "Birthday": null,
    "BusinessPhones": [],
    "Calendar": {
      "AllowedOnlineMeetingProviders": null,
      "CalendarGroupId": null,
      "CalendarPermissions": null,
      "CalendarView": null,
      "CanEdit": null,
      "CanShare": null,
      "CanViewPrivateItems": null,
      "ChangeKey": null,
      "Color": null,
      "DefaultOnlineMeetingProvider": null,
      "Events": null,
      "HexColor": null,
      "Id": null,
      "IsDefaultCalendar": null,
      "IsRemovable": null,
      "IsShared": null,
      "IsSharedWithMe": null,
      "IsTallyingResponses": null,
      "MultiValueExtendedProperties": null,
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphEmailAddress",
      "SingleValueExtendedProperties": null
    },
    "CalendarGroups": null,
    "CalendarView": null,
    "Calendars": null,
    "Chats": null,
    "City": null,
    "CloudPCs": null,
    "CloudRealtimeCommunicationInfo": {
      "IsSipEnabled": false
    },
    "CompanyName": null,
    "ConsentProvidedForMinor": null,
    "ContactFolders": null,
    "Contacts": null,
    "Country": null,
    "CreatedDateTime": "2023-07-20T05:49:32Z",
    "CreatedObjects": null,
    "CreationType": null,
    "CustomSecurityAttributes": {},
    "DeletedDateTime": null,
    "Department": null,
    "DeviceEnrollmentConfigurations": null,
    "DeviceEnrollmentLimit": null,
    "DeviceKeys": [],
    "DeviceManagementTroubleshootingEvents": null,
    "Devices": null,
    "DirectReports": null,
    "DisplayName": "Ben Parkinson",
    "Drive": {
      "Activities": null,
      "Bundles": null,
      "CreatedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "CreatedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "CreatedDateTime": null,
      "Description": null,
      "DriveType": null,
      "ETag": null,
      "Following": null,
      "Id": null,
      "Items": null,
      "LastModifiedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "LastModifiedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "LastModifiedDateTime": null,
      "List": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphList",
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "ParentReference": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphItemReference",
      "Quota": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphQuota",
      "Root": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphDriveItem",
      "SharePointIds": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSharepointIds",
      "Special": null,
      "System": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSystemFacet",
      "WebUrl": null
    },
    "Drives": null,
    "EmployeeExperience": {
      "Id": null,
      "LearningCourseActivities": null
    },
    "EmployeeHireDate": null,
    "EmployeeId": null,
    "EmployeeLeaveDateTime": null,
    "EmployeeOrgData": {
      "CostCenter": null,
      "Division": null
    },
    "EmployeeType": null,
    "Events": null,
    "Extensions": null,
    "ExternalUserState": null,
    "ExternalUserStateChangeDateTime": null,
    "FaxNumber": null,
    "FollowedSites": null,
    "GivenName": null,
    "HireDate": null,
    "Id": "a649603c-bef4-48d6-879f-82cfea5e5e59",
    "Identities": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphObjectIdentity"
    ],
    "ImAddresses": [
      "ben.parkinson_priv@sdablueprinthybriddev.onmicrosoft.com"
    ],
    "InferenceClassification": {
      "Id": null,
      "Overrides": null
    },
    "InfoCatalogs": [],
    "InformationProtection": {
      "Bitlocker": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphBitlocker",
      "DataLossPreventionPolicies": null,
      "Id": null,
      "Policy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphInformationProtectionPolicy",
      "SensitivityLabels": null,
      "SensitivityPolicySettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSensitivityPolicySettings",
      "ThreatAssessmentRequests": null
    },
    "Insights": {
      "Id": null,
      "Shared": null,
      "Trending": null,
      "Used": null
    },
    "Interests": null,
    "IsLicenseReconciliationNeeded": false,
    "IsManagementRestricted": null,
    "IsResourceAccount": null,
    "JobTitle": null,
    "JoinedGroups": null,
    "JoinedTeams": null,
    "LastPasswordChangeDateTime": null,
    "LegalAgeGroupClassification": null,
    "LicenseAssignmentStates": null,
    "LicenseDetails": null,
    "Mail": "ben.parkinson_priv@sdablueprinthybriddev.onmicrosoft.com",
    "MailFolders": null,
    "MailNickname": "ben.parkinson",
    "MailboxSettings": {
      "ArchiveFolder": null,
      "AutomaticRepliesSetting": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAutomaticRepliesSetting",
      "DateFormat": null,
      "DelegateMeetingMessageDeliveryOptions": null,
      "Language": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphLocaleInfo",
      "TimeFormat": null,
      "TimeZone": null,
      "UserPurpose": null,
      "UserPurposeV2": null,
      "WorkingHours": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphWorkingHours"
    },
    "ManagedAppRegistrations": null,
    "ManagedDevices": null,
    "Manager": {
      "DeletedDateTime": null,
      "Id": null
    },
    "MemberOf": null,
    "Messages": null,
    "MobileAppIntentAndStates": null,
    "MobileAppTroubleshootingEvents": null,
    "MobilePhone": null,
    "MySite": null,
    "Notifications": null,
    "Oauth2PermissionGrants": null,
    "OfficeLocation": null,
    "OnPremisesDistinguishedName": null,
    "OnPremisesDomainName": null,
    "OnPremisesExtensionAttributes": {
      "ExtensionAttribute1": null,
      "ExtensionAttribute10": null,
      "ExtensionAttribute11": null,
      "ExtensionAttribute12": null,
      "ExtensionAttribute13": null,
      "ExtensionAttribute14": null,
      "ExtensionAttribute15": null,
      "ExtensionAttribute2": null,
      "ExtensionAttribute3": null,
      "ExtensionAttribute4": null,
      "ExtensionAttribute5": null,
      "ExtensionAttribute6": null,
      "ExtensionAttribute7": null,
      "ExtensionAttribute8": null,
      "ExtensionAttribute9": null
    },
    "OnPremisesImmutableId": null,
    "OnPremisesLastSyncDateTime": null,
    "OnPremisesProvisioningErrors": [],
    "OnPremisesSamAccountName": null,
    "OnPremisesSecurityIdentifier": null,
    "OnPremisesSipInfo": {
      "IsSipEnabled": false,
      "SipDeploymentLocation": null,
      "SipPrimaryAddress": null
    },
    "OnPremisesSyncEnabled": null,
    "OnPremisesUserPrincipalName": null,
    "Onenote": {
      "Id": null,
      "Notebooks": null,
      "Operations": null,
      "Pages": null,
      "Resources": null,
      "SectionGroups": null,
      "Sections": null
    },
    "OnlineMeetings": null,
    "OtherMails": [],
    "Outlook": {
      "Id": null,
      "MasterCategories": null,
      "TaskFolders": null,
      "TaskGroups": null,
      "Tasks": null
    },
    "OwnedDevices": null,
    "OwnedObjects": null,
    "PasswordPolicies": null,
    "PasswordProfile": {
      "ForceChangePasswordNextSignIn": null,
      "ForceChangePasswordNextSignInWithMfa": null,
      "Password": null
    },
    "PastProjects": null,
    "PendingAccessReviewInstances": null,
    "People": null,
    "PermissionGrants": null,
    "Photo": {
      "Height": null,
      "Id": null,
      "Width": null
    },
    "Photos": null,
    "Planner": {
      "All": null,
      "FavoritePlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerFavoritePlanReferenceCollection",
      "FavoritePlans": null,
      "Id": null,
      "MyDayTasks": null,
      "Plans": null,
      "RecentPlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerRecentPlanReferenceCollection",
      "RecentPlans": null,
      "RosterPlans": null,
      "Tasks": null
    },
    "PostalCode": null,
    "PreferredDataLocation": null,
    "PreferredLanguage": null,
    "PreferredName": null,
    "Presence": {
      "Activity": null,
      "Availability": null,
      "Id": null,
      "OutOfOfficeSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphOutOfOfficeSettings",
      "StatusMessage": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPresenceStatusMessage"
    },
    "Print": {
      "RecentPrinterShares": null
    },
    "Profile": {
      "Account": null,
      "Addresses": null,
      "Anniversaries": null,
      "Awards": null,
      "Certifications": null,
      "EducationalActivities": null,
      "Emails": null,
      "Id": null,
      "Interests": null,
      "Languages": null,
      "Names": null,
      "Notes": null,
      "Patents": null,
      "Phones": null,
      "Positions": null,
      "Projects": null,
      "Publications": null,
      "Skills": null,
      "WebAccounts": null,
      "Websites": null
    },
    "ProvisionedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan"
    ],
    "ProxyAddresses": [
      "smtp:ben.parkinson@sdablueprinthybriddev.onmicrosoft.com",
      "SMTP:ben.parkinson_priv@sdablueprinthybriddev.onmicrosoft.com"
    ],
    "RefreshTokensValidFromDateTime": "2024-02-20T05:38:17Z",
    "RegisteredDevices": null,
    "Responsibilities": null,
    "Schools": null,
    "ScopedRoleMemberOf": null,
    "Security": {
      "Id": null,
      "InformationProtection": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSecurityInformationProtection"
    },
    "SecurityIdentifier": "S-1-12-1-2789826620-1222033140-3481444231-1499356906",
    "ServiceProvisioningErrors": [],
    "Settings": {
      "ContactMergeSuggestions": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphContactMergeSuggestions",
      "ContributionToContentDiscoveryAsOrganizationDisabled": null,
      "ContributionToContentDiscoveryDisabled": null,
      "Id": null,
      "ItemInsights": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUserInsightsSettings",
      "RegionalAndLanguageSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphRegionalAndLanguageSettings",
      "ShiftPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphShiftPreferences"
    },
    "ShowInAddressList": null,
    "SignInActivity": {
      "LastNonInteractiveSignInDateTime": null,
      "LastNonInteractiveSignInRequestId": null,
      "LastSignInDateTime": null,
      "LastSignInRequestId": null,
      "LastSuccessfulSignInDateTime": null,
      "LastSuccessfulSignInRequestId": null
    },
    "SignInSessionsValidFromDateTime": "2024-02-20T05:38:17Z",
    "Skills": null,
    "Sponsors": null,
    "State": null,
    "StreetAddress": null,
    "Surname": null,
    "Teamwork": {
      "AssociatedTeams": null,
      "Id": null,
      "InstalledApps": null,
      "Locale": null,
      "Region": null
    },
    "Todo": {
      "Id": null,
      "Lists": null
    },
    "TransitiveMemberOf": null,
    "TransitiveReports": null,
    "UsageLocation": "AU",
    "UsageRights": null,
    "UserPrincipalName": "ben.parkinson_priv@sdablueprinthybriddev.onmicrosoft.com",
    "UserType": "Member",
    "VirtualEvents": {
      "Id": null,
      "Webinars": null
    },
    "WindowsInformationProtectionDeviceRegistrations": null,
    "AdditionalProperties": {}
  },
  {
    "AboutMe": null,
    "AccountEnabled": true,
    "Activities": null,
    "AgeGroup": null,
    "AgreementAcceptances": null,
    "Analytics": {
      "ActivityStatistics": null,
      "Id": null,
      "Settings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSettings"
    },
    "AppConsentRequestsForApproval": null,
    "AppRoleAssignedResources": null,
    "AppRoleAssignments": null,
    "Approvals": null,
    "AssignedLicenses": [],
    "AssignedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan"
    ],
    "Authentication": {
      "EmailMethods": null,
      "Fido2Methods": null,
      "Id": null,
      "Methods": null,
      "MicrosoftAuthenticatorMethods": null,
      "Operations": null,
      "PasswordMethods": null,
      "PasswordlessMicrosoftAuthenticatorMethods": null,
      "PhoneMethods": null,
      "PlatformCredentialMethods": null,
      "SignInPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSignInPreferences",
      "SoftwareOathMethods": null,
      "TemporaryAccessPassMethods": null,
      "WindowsHelloForBusinessMethods": null
    },
    "AuthorizationInfo": {
      "CertificateUserIds": ""
    },
    "Birthday": null,
    "BusinessPhones": [],
    "Calendar": {
      "AllowedOnlineMeetingProviders": null,
      "CalendarGroupId": null,
      "CalendarPermissions": null,
      "CalendarView": null,
      "CanEdit": null,
      "CanShare": null,
      "CanViewPrivateItems": null,
      "ChangeKey": null,
      "Color": null,
      "DefaultOnlineMeetingProvider": null,
      "Events": null,
      "HexColor": null,
      "Id": null,
      "IsDefaultCalendar": null,
      "IsRemovable": null,
      "IsShared": null,
      "IsSharedWithMe": null,
      "IsTallyingResponses": null,
      "MultiValueExtendedProperties": null,
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphEmailAddress",
      "SingleValueExtendedProperties": null
    },
    "CalendarGroups": null,
    "CalendarView": null,
    "Calendars": null,
    "Chats": null,
    "City": null,
    "CloudPCs": null,
    "CloudRealtimeCommunicationInfo": {
      "IsSipEnabled": false
    },
    "CompanyName": null,
    "ConsentProvidedForMinor": null,
    "ContactFolders": null,
    "Contacts": null,
    "Country": null,
    "CreatedDateTime": "2023-07-25T23:49:08Z",
    "CreatedObjects": null,
    "CreationType": null,
    "CustomSecurityAttributes": {},
    "DeletedDateTime": null,
    "Department": null,
    "DeviceEnrollmentConfigurations": null,
    "DeviceEnrollmentLimit": null,
    "DeviceKeys": [],
    "DeviceManagementTroubleshootingEvents": null,
    "Devices": null,
    "DirectReports": null,
    "DisplayName": "Break Glass 1",
    "Drive": {
      "Activities": null,
      "Bundles": null,
      "CreatedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "CreatedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "CreatedDateTime": null,
      "Description": null,
      "DriveType": null,
      "ETag": null,
      "Following": null,
      "Id": null,
      "Items": null,
      "LastModifiedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "LastModifiedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "LastModifiedDateTime": null,
      "List": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphList",
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "ParentReference": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphItemReference",
      "Quota": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphQuota",
      "Root": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphDriveItem",
      "SharePointIds": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSharepointIds",
      "Special": null,
      "System": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSystemFacet",
      "WebUrl": null
    },
    "Drives": null,
    "EmployeeExperience": {
      "Id": null,
      "LearningCourseActivities": null
    },
    "EmployeeHireDate": null,
    "EmployeeId": null,
    "EmployeeLeaveDateTime": null,
    "EmployeeOrgData": {
      "CostCenter": null,
      "Division": null
    },
    "EmployeeType": null,
    "Events": null,
    "Extensions": null,
    "ExternalUserState": null,
    "ExternalUserStateChangeDateTime": null,
    "FaxNumber": null,
    "FollowedSites": null,
    "GivenName": null,
    "HireDate": null,
    "Id": "7c60be77-21a0-4b4c-9880-0d48a5fb5a60",
    "Identities": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphObjectIdentity"
    ],
    "ImAddresses": [],
    "InferenceClassification": {
      "Id": null,
      "Overrides": null
    },
    "InfoCatalogs": [],
    "InformationProtection": {
      "Bitlocker": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphBitlocker",
      "DataLossPreventionPolicies": null,
      "Id": null,
      "Policy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphInformationProtectionPolicy",
      "SensitivityLabels": null,
      "SensitivityPolicySettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSensitivityPolicySettings",
      "ThreatAssessmentRequests": null
    },
    "Insights": {
      "Id": null,
      "Shared": null,
      "Trending": null,
      "Used": null
    },
    "Interests": null,
    "IsLicenseReconciliationNeeded": false,
    "IsManagementRestricted": null,
    "IsResourceAccount": null,
    "JobTitle": null,
    "JoinedGroups": null,
    "JoinedTeams": null,
    "LastPasswordChangeDateTime": null,
    "LegalAgeGroupClassification": null,
    "LicenseAssignmentStates": null,
    "LicenseDetails": null,
    "Mail": null,
    "MailFolders": null,
    "MailNickname": "break.glass_priv1",
    "MailboxSettings": {
      "ArchiveFolder": null,
      "AutomaticRepliesSetting": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAutomaticRepliesSetting",
      "DateFormat": null,
      "DelegateMeetingMessageDeliveryOptions": null,
      "Language": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphLocaleInfo",
      "TimeFormat": null,
      "TimeZone": null,
      "UserPurpose": null,
      "UserPurposeV2": null,
      "WorkingHours": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphWorkingHours"
    },
    "ManagedAppRegistrations": null,
    "ManagedDevices": null,
    "Manager": {
      "DeletedDateTime": null,
      "Id": null
    },
    "MemberOf": null,
    "Messages": null,
    "MobileAppIntentAndStates": null,
    "MobileAppTroubleshootingEvents": null,
    "MobilePhone": null,
    "MySite": null,
    "Notifications": null,
    "Oauth2PermissionGrants": null,
    "OfficeLocation": null,
    "OnPremisesDistinguishedName": null,
    "OnPremisesDomainName": null,
    "OnPremisesExtensionAttributes": {
      "ExtensionAttribute1": null,
      "ExtensionAttribute10": null,
      "ExtensionAttribute11": null,
      "ExtensionAttribute12": null,
      "ExtensionAttribute13": null,
      "ExtensionAttribute14": null,
      "ExtensionAttribute15": null,
      "ExtensionAttribute2": null,
      "ExtensionAttribute3": null,
      "ExtensionAttribute4": null,
      "ExtensionAttribute5": null,
      "ExtensionAttribute6": null,
      "ExtensionAttribute7": null,
      "ExtensionAttribute8": null,
      "ExtensionAttribute9": null
    },
    "OnPremisesImmutableId": null,
    "OnPremisesLastSyncDateTime": null,
    "OnPremisesProvisioningErrors": [],
    "OnPremisesSamAccountName": null,
    "OnPremisesSecurityIdentifier": null,
    "OnPremisesSipInfo": {
      "IsSipEnabled": false,
      "SipDeploymentLocation": null,
      "SipPrimaryAddress": null
    },
    "OnPremisesSyncEnabled": null,
    "OnPremisesUserPrincipalName": null,
    "Onenote": {
      "Id": null,
      "Notebooks": null,
      "Operations": null,
      "Pages": null,
      "Resources": null,
      "SectionGroups": null,
      "Sections": null
    },
    "OnlineMeetings": null,
    "OtherMails": [],
    "Outlook": {
      "Id": null,
      "MasterCategories": null,
      "TaskFolders": null,
      "TaskGroups": null,
      "Tasks": null
    },
    "OwnedDevices": null,
    "OwnedObjects": null,
    "PasswordPolicies": null,
    "PasswordProfile": {
      "ForceChangePasswordNextSignIn": true,
      "ForceChangePasswordNextSignInWithMfa": false,
      "Password": null
    },
    "PastProjects": null,
    "PendingAccessReviewInstances": null,
    "People": null,
    "PermissionGrants": null,
    "Photo": {
      "Height": null,
      "Id": null,
      "Width": null
    },
    "Photos": null,
    "Planner": {
      "All": null,
      "FavoritePlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerFavoritePlanReferenceCollection",
      "FavoritePlans": null,
      "Id": null,
      "MyDayTasks": null,
      "Plans": null,
      "RecentPlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerRecentPlanReferenceCollection",
      "RecentPlans": null,
      "RosterPlans": null,
      "Tasks": null
    },
    "PostalCode": null,
    "PreferredDataLocation": null,
    "PreferredLanguage": null,
    "PreferredName": null,
    "Presence": {
      "Activity": null,
      "Availability": null,
      "Id": null,
      "OutOfOfficeSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphOutOfOfficeSettings",
      "StatusMessage": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPresenceStatusMessage"
    },
    "Print": {
      "RecentPrinterShares": null
    },
    "Profile": {
      "Account": null,
      "Addresses": null,
      "Anniversaries": null,
      "Awards": null,
      "Certifications": null,
      "EducationalActivities": null,
      "Emails": null,
      "Id": null,
      "Interests": null,
      "Languages": null,
      "Names": null,
      "Notes": null,
      "Patents": null,
      "Phones": null,
      "Positions": null,
      "Projects": null,
      "Publications": null,
      "Skills": null,
      "WebAccounts": null,
      "Websites": null
    },
    "ProvisionedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan"
    ],
    "ProxyAddresses": [],
    "RefreshTokensValidFromDateTime": "2024-03-06T23:56:27Z",
    "RegisteredDevices": null,
    "Responsibilities": null,
    "Schools": null,
    "ScopedRoleMemberOf": null,
    "Security": {
      "Id": null,
      "InformationProtection": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSecurityInformationProtection"
    },
    "SecurityIdentifier": "S-1-12-1-2086714999-1263280544-1208844440-1616575397",
    "ServiceProvisioningErrors": [],
    "Settings": {
      "ContactMergeSuggestions": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphContactMergeSuggestions",
      "ContributionToContentDiscoveryAsOrganizationDisabled": null,
      "ContributionToContentDiscoveryDisabled": null,
      "Id": null,
      "ItemInsights": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUserInsightsSettings",
      "RegionalAndLanguageSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphRegionalAndLanguageSettings",
      "ShiftPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphShiftPreferences"
    },
    "ShowInAddressList": null,
    "SignInActivity": {
      "LastNonInteractiveSignInDateTime": null,
      "LastNonInteractiveSignInRequestId": null,
      "LastSignInDateTime": null,
      "LastSignInRequestId": null,
      "LastSuccessfulSignInDateTime": null,
      "LastSuccessfulSignInRequestId": null
    },
    "SignInSessionsValidFromDateTime": "2024-03-06T23:56:27Z",
    "Skills": null,
    "Sponsors": null,
    "State": null,
    "StreetAddress": null,
    "Surname": null,
    "Teamwork": {
      "AssociatedTeams": null,
      "Id": null,
      "InstalledApps": null,
      "Locale": null,
      "Region": null
    },
    "Todo": {
      "Id": null,
      "Lists": null
    },
    "TransitiveMemberOf": null,
    "TransitiveReports": null,
    "UsageLocation": "AU",
    "UsageRights": null,
    "UserPrincipalName": "break.glass_priv1@sdablueprinthybriddev.onmicrosoft.com",
    "UserType": "Member",
    "VirtualEvents": {
      "Id": null,
      "Webinars": null
    },
    "WindowsInformationProtectionDeviceRegistrations": null,
    "AdditionalProperties": {}
  },
  {
    "AboutMe": null,
    "AccountEnabled": true,
    "Activities": null,
    "AgeGroup": null,
    "AgreementAcceptances": null,
    "Analytics": {
      "ActivityStatistics": null,
      "Id": null,
      "Settings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSettings"
    },
    "AppConsentRequestsForApproval": null,
    "AppRoleAssignedResources": null,
    "AppRoleAssignments": null,
    "Approvals": null,
    "AssignedLicenses": [],
    "AssignedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan"
    ],
    "Authentication": {
      "EmailMethods": null,
      "Fido2Methods": null,
      "Id": null,
      "Methods": null,
      "MicrosoftAuthenticatorMethods": null,
      "Operations": null,
      "PasswordMethods": null,
      "PasswordlessMicrosoftAuthenticatorMethods": null,
      "PhoneMethods": null,
      "PlatformCredentialMethods": null,
      "SignInPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSignInPreferences",
      "SoftwareOathMethods": null,
      "TemporaryAccessPassMethods": null,
      "WindowsHelloForBusinessMethods": null
    },
    "AuthorizationInfo": {
      "CertificateUserIds": ""
    },
    "Birthday": null,
    "BusinessPhones": [],
    "Calendar": {
      "AllowedOnlineMeetingProviders": null,
      "CalendarGroupId": null,
      "CalendarPermissions": null,
      "CalendarView": null,
      "CanEdit": null,
      "CanShare": null,
      "CanViewPrivateItems": null,
      "ChangeKey": null,
      "Color": null,
      "DefaultOnlineMeetingProvider": null,
      "Events": null,
      "HexColor": null,
      "Id": null,
      "IsDefaultCalendar": null,
      "IsRemovable": null,
      "IsShared": null,
      "IsSharedWithMe": null,
      "IsTallyingResponses": null,
      "MultiValueExtendedProperties": null,
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphEmailAddress",
      "SingleValueExtendedProperties": null
    },
    "CalendarGroups": null,
    "CalendarView": null,
    "Calendars": null,
    "Chats": null,
    "City": null,
    "CloudPCs": null,
    "CloudRealtimeCommunicationInfo": {
      "IsSipEnabled": null
    },
    "CompanyName": null,
    "ConsentProvidedForMinor": null,
    "ContactFolders": null,
    "Contacts": null,
    "Country": null,
    "CreatedDateTime": "2023-07-26T01:27:54Z",
    "CreatedObjects": null,
    "CreationType": null,
    "CustomSecurityAttributes": {},
    "DeletedDateTime": null,
    "Department": null,
    "DeviceEnrollmentConfigurations": null,
    "DeviceEnrollmentLimit": null,
    "DeviceKeys": [],
    "DeviceManagementTroubleshootingEvents": null,
    "Devices": null,
    "DirectReports": null,
    "DisplayName": "Break Glass 2",
    "Drive": {
      "Activities": null,
      "Bundles": null,
      "CreatedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "CreatedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "CreatedDateTime": null,
      "Description": null,
      "DriveType": null,
      "ETag": null,
      "Following": null,
      "Id": null,
      "Items": null,
      "LastModifiedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "LastModifiedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "LastModifiedDateTime": null,
      "List": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphList",
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "ParentReference": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphItemReference",
      "Quota": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphQuota",
      "Root": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphDriveItem",
      "SharePointIds": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSharepointIds",
      "Special": null,
      "System": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSystemFacet",
      "WebUrl": null
    },
    "Drives": null,
    "EmployeeExperience": {
      "Id": null,
      "LearningCourseActivities": null
    },
    "EmployeeHireDate": null,
    "EmployeeId": null,
    "EmployeeLeaveDateTime": null,
    "EmployeeOrgData": {
      "CostCenter": null,
      "Division": null
    },
    "EmployeeType": null,
    "Events": null,
    "Extensions": null,
    "ExternalUserState": null,
    "ExternalUserStateChangeDateTime": null,
    "FaxNumber": null,
    "FollowedSites": null,
    "GivenName": null,
    "HireDate": null,
    "Id": "1b9186c4-edf1-4b16-a486-e14603538353",
    "Identities": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphObjectIdentity"
    ],
    "ImAddresses": [],
    "InferenceClassification": {
      "Id": null,
      "Overrides": null
    },
    "InfoCatalogs": [],
    "InformationProtection": {
      "Bitlocker": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphBitlocker",
      "DataLossPreventionPolicies": null,
      "Id": null,
      "Policy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphInformationProtectionPolicy",
      "SensitivityLabels": null,
      "SensitivityPolicySettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSensitivityPolicySettings",
      "ThreatAssessmentRequests": null
    },
    "Insights": {
      "Id": null,
      "Shared": null,
      "Trending": null,
      "Used": null
    },
    "Interests": null,
    "IsLicenseReconciliationNeeded": false,
    "IsManagementRestricted": null,
    "IsResourceAccount": null,
    "JobTitle": null,
    "JoinedGroups": null,
    "JoinedTeams": null,
    "LastPasswordChangeDateTime": null,
    "LegalAgeGroupClassification": null,
    "LicenseAssignmentStates": null,
    "LicenseDetails": null,
    "Mail": null,
    "MailFolders": null,
    "MailNickname": "break.glass_priv2",
    "MailboxSettings": {
      "ArchiveFolder": null,
      "AutomaticRepliesSetting": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAutomaticRepliesSetting",
      "DateFormat": null,
      "DelegateMeetingMessageDeliveryOptions": null,
      "Language": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphLocaleInfo",
      "TimeFormat": null,
      "TimeZone": null,
      "UserPurpose": null,
      "UserPurposeV2": null,
      "WorkingHours": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphWorkingHours"
    },
    "ManagedAppRegistrations": null,
    "ManagedDevices": null,
    "Manager": {
      "DeletedDateTime": null,
      "Id": null
    },
    "MemberOf": null,
    "Messages": null,
    "MobileAppIntentAndStates": null,
    "MobileAppTroubleshootingEvents": null,
    "MobilePhone": null,
    "MySite": null,
    "Notifications": null,
    "Oauth2PermissionGrants": null,
    "OfficeLocation": null,
    "OnPremisesDistinguishedName": null,
    "OnPremisesDomainName": null,
    "OnPremisesExtensionAttributes": {
      "ExtensionAttribute1": null,
      "ExtensionAttribute10": null,
      "ExtensionAttribute11": null,
      "ExtensionAttribute12": null,
      "ExtensionAttribute13": null,
      "ExtensionAttribute14": null,
      "ExtensionAttribute15": null,
      "ExtensionAttribute2": null,
      "ExtensionAttribute3": null,
      "ExtensionAttribute4": null,
      "ExtensionAttribute5": null,
      "ExtensionAttribute6": null,
      "ExtensionAttribute7": null,
      "ExtensionAttribute8": null,
      "ExtensionAttribute9": null
    },
    "OnPremisesImmutableId": null,
    "OnPremisesLastSyncDateTime": null,
    "OnPremisesProvisioningErrors": [],
    "OnPremisesSamAccountName": null,
    "OnPremisesSecurityIdentifier": null,
    "OnPremisesSipInfo": {
      "IsSipEnabled": false,
      "SipDeploymentLocation": null,
      "SipPrimaryAddress": null
    },
    "OnPremisesSyncEnabled": null,
    "OnPremisesUserPrincipalName": null,
    "Onenote": {
      "Id": null,
      "Notebooks": null,
      "Operations": null,
      "Pages": null,
      "Resources": null,
      "SectionGroups": null,
      "Sections": null
    },
    "OnlineMeetings": null,
    "OtherMails": [],
    "Outlook": {
      "Id": null,
      "MasterCategories": null,
      "TaskFolders": null,
      "TaskGroups": null,
      "Tasks": null
    },
    "OwnedDevices": null,
    "OwnedObjects": null,
    "PasswordPolicies": null,
    "PasswordProfile": {
      "ForceChangePasswordNextSignIn": null,
      "ForceChangePasswordNextSignInWithMfa": null,
      "Password": null
    },
    "PastProjects": null,
    "PendingAccessReviewInstances": null,
    "People": null,
    "PermissionGrants": null,
    "Photo": {
      "Height": null,
      "Id": null,
      "Width": null
    },
    "Photos": null,
    "Planner": {
      "All": null,
      "FavoritePlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerFavoritePlanReferenceCollection",
      "FavoritePlans": null,
      "Id": null,
      "MyDayTasks": null,
      "Plans": null,
      "RecentPlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerRecentPlanReferenceCollection",
      "RecentPlans": null,
      "RosterPlans": null,
      "Tasks": null
    },
    "PostalCode": null,
    "PreferredDataLocation": null,
    "PreferredLanguage": null,
    "PreferredName": null,
    "Presence": {
      "Activity": null,
      "Availability": null,
      "Id": null,
      "OutOfOfficeSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphOutOfOfficeSettings",
      "StatusMessage": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPresenceStatusMessage"
    },
    "Print": {
      "RecentPrinterShares": null
    },
    "Profile": {
      "Account": null,
      "Addresses": null,
      "Anniversaries": null,
      "Awards": null,
      "Certifications": null,
      "EducationalActivities": null,
      "Emails": null,
      "Id": null,
      "Interests": null,
      "Languages": null,
      "Names": null,
      "Notes": null,
      "Patents": null,
      "Phones": null,
      "Positions": null,
      "Projects": null,
      "Publications": null,
      "Skills": null,
      "WebAccounts": null,
      "Websites": null
    },
    "ProvisionedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan"
    ],
    "ProxyAddresses": [],
    "RefreshTokensValidFromDateTime": "2024-02-07T00:06:53Z",
    "RegisteredDevices": null,
    "Responsibilities": null,
    "Schools": null,
    "ScopedRoleMemberOf": null,
    "Security": {
      "Id": null,
      "InformationProtection": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSecurityInformationProtection"
    },
    "SecurityIdentifier": "S-1-12-1-462522052-1259793905-1189185188-1401115395",
    "ServiceProvisioningErrors": [],
    "Settings": {
      "ContactMergeSuggestions": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphContactMergeSuggestions",
      "ContributionToContentDiscoveryAsOrganizationDisabled": null,
      "ContributionToContentDiscoveryDisabled": null,
      "Id": null,
      "ItemInsights": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUserInsightsSettings",
      "RegionalAndLanguageSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphRegionalAndLanguageSettings",
      "ShiftPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphShiftPreferences"
    },
    "ShowInAddressList": null,
    "SignInActivity": {
      "LastNonInteractiveSignInDateTime": null,
      "LastNonInteractiveSignInRequestId": null,
      "LastSignInDateTime": null,
      "LastSignInRequestId": null,
      "LastSuccessfulSignInDateTime": null,
      "LastSuccessfulSignInRequestId": null
    },
    "SignInSessionsValidFromDateTime": "2024-02-07T00:06:53Z",
    "Skills": null,
    "Sponsors": null,
    "State": null,
    "StreetAddress": null,
    "Surname": null,
    "Teamwork": {
      "AssociatedTeams": null,
      "Id": null,
      "InstalledApps": null,
      "Locale": null,
      "Region": null
    },
    "Todo": {
      "Id": null,
      "Lists": null
    },
    "TransitiveMemberOf": null,
    "TransitiveReports": null,
    "UsageLocation": "AU",
    "UsageRights": null,
    "UserPrincipalName": "break.glass_priv2@sdablueprinthybriddev.onmicrosoft.com",
    "UserType": "Member",
    "VirtualEvents": {
      "Id": null,
      "Webinars": null
    },
    "WindowsInformationProtectionDeviceRegistrations": null,
    "AdditionalProperties": {}
  },
  {
    "AboutMe": null,
    "AccountEnabled": true,
    "Activities": null,
    "AgeGroup": null,
    "AgreementAcceptances": null,
    "Analytics": {
      "ActivityStatistics": null,
      "Id": null,
      "Settings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSettings"
    },
    "AppConsentRequestsForApproval": null,
    "AppRoleAssignedResources": null,
    "AppRoleAssignments": null,
    "Approvals": null,
    "AssignedLicenses": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedLicense"
    ],
    "AssignedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan"
    ],
    "Authentication": {
      "EmailMethods": null,
      "Fido2Methods": null,
      "Id": null,
      "Methods": null,
      "MicrosoftAuthenticatorMethods": null,
      "Operations": null,
      "PasswordMethods": null,
      "PasswordlessMicrosoftAuthenticatorMethods": null,
      "PhoneMethods": null,
      "PlatformCredentialMethods": null,
      "SignInPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSignInPreferences",
      "SoftwareOathMethods": null,
      "TemporaryAccessPassMethods": null,
      "WindowsHelloForBusinessMethods": null
    },
    "AuthorizationInfo": {
      "CertificateUserIds": ""
    },
    "Birthday": null,
    "BusinessPhones": [],
    "Calendar": {
      "AllowedOnlineMeetingProviders": null,
      "CalendarGroupId": null,
      "CalendarPermissions": null,
      "CalendarView": null,
      "CanEdit": null,
      "CanShare": null,
      "CanViewPrivateItems": null,
      "ChangeKey": null,
      "Color": null,
      "DefaultOnlineMeetingProvider": null,
      "Events": null,
      "HexColor": null,
      "Id": null,
      "IsDefaultCalendar": null,
      "IsRemovable": null,
      "IsShared": null,
      "IsSharedWithMe": null,
      "IsTallyingResponses": null,
      "MultiValueExtendedProperties": null,
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphEmailAddress",
      "SingleValueExtendedProperties": null
    },
    "CalendarGroups": null,
    "CalendarView": null,
    "Calendars": null,
    "Chats": null,
    "City": null,
    "CloudPCs": null,
    "CloudRealtimeCommunicationInfo": {
      "IsSipEnabled": false
    },
    "CompanyName": null,
    "ConsentProvidedForMinor": null,
    "ContactFolders": null,
    "Contacts": null,
    "Country": null,
    "CreatedDateTime": "2023-12-07T23:53:39Z",
    "CreatedObjects": null,
    "CreationType": null,
    "CustomSecurityAttributes": {},
    "DeletedDateTime": null,
    "Department": null,
    "DeviceEnrollmentConfigurations": null,
    "DeviceEnrollmentLimit": null,
    "DeviceKeys": [],
    "DeviceManagementTroubleshootingEvents": null,
    "Devices": null,
    "DirectReports": null,
    "DisplayName": "Finlay Semmens",
    "Drive": {
      "Activities": null,
      "Bundles": null,
      "CreatedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "CreatedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "CreatedDateTime": null,
      "Description": null,
      "DriveType": null,
      "ETag": null,
      "Following": null,
      "Id": null,
      "Items": null,
      "LastModifiedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "LastModifiedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "LastModifiedDateTime": null,
      "List": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphList",
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "ParentReference": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphItemReference",
      "Quota": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphQuota",
      "Root": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphDriveItem",
      "SharePointIds": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSharepointIds",
      "Special": null,
      "System": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSystemFacet",
      "WebUrl": null
    },
    "Drives": null,
    "EmployeeExperience": {
      "Id": null,
      "LearningCourseActivities": null
    },
    "EmployeeHireDate": null,
    "EmployeeId": null,
    "EmployeeLeaveDateTime": null,
    "EmployeeOrgData": {
      "CostCenter": null,
      "Division": null
    },
    "EmployeeType": null,
    "Events": null,
    "Extensions": null,
    "ExternalUserState": null,
    "ExternalUserStateChangeDateTime": null,
    "FaxNumber": null,
    "FollowedSites": null,
    "GivenName": "Finaly",
    "HireDate": null,
    "Id": "ef1d7a02-fea5-4bb9-bad6-11aca713d59b",
    "Identities": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphObjectIdentity"
    ],
    "ImAddresses": [
      "ef1d7a02fea54bb9bad611aca713d59bfinlay.semmens_priv@sdablueprinthybriddev.onmicrosoft.com"
    ],
    "InferenceClassification": {
      "Id": null,
      "Overrides": null
    },
    "InfoCatalogs": [],
    "InformationProtection": {
      "Bitlocker": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphBitlocker",
      "DataLossPreventionPolicies": null,
      "Id": null,
      "Policy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphInformationProtectionPolicy",
      "SensitivityLabels": null,
      "SensitivityPolicySettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSensitivityPolicySettings",
      "ThreatAssessmentRequests": null
    },
    "Insights": {
      "Id": null,
      "Shared": null,
      "Trending": null,
      "Used": null
    },
    "Interests": null,
    "IsLicenseReconciliationNeeded": false,
    "IsManagementRestricted": null,
    "IsResourceAccount": null,
    "JobTitle": null,
    "JoinedGroups": null,
    "JoinedTeams": null,
    "LastPasswordChangeDateTime": null,
    "LegalAgeGroupClassification": null,
    "LicenseAssignmentStates": null,
    "LicenseDetails": null,
    "Mail": "finlay.semmens_priv@sdablueprinthybriddev.onmicrosoft.com",
    "MailFolders": null,
    "MailNickname": "finlay.semmens",
    "MailboxSettings": {
      "ArchiveFolder": null,
      "AutomaticRepliesSetting": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAutomaticRepliesSetting",
      "DateFormat": null,
      "DelegateMeetingMessageDeliveryOptions": null,
      "Language": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphLocaleInfo",
      "TimeFormat": null,
      "TimeZone": null,
      "UserPurpose": null,
      "UserPurposeV2": null,
      "WorkingHours": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphWorkingHours"
    },
    "ManagedAppRegistrations": null,
    "ManagedDevices": null,
    "Manager": {
      "DeletedDateTime": null,
      "Id": null
    },
    "MemberOf": null,
    "Messages": null,
    "MobileAppIntentAndStates": null,
    "MobileAppTroubleshootingEvents": null,
    "MobilePhone": null,
    "MySite": null,
    "Notifications": null,
    "Oauth2PermissionGrants": null,
    "OfficeLocation": null,
    "OnPremisesDistinguishedName": null,
    "OnPremisesDomainName": null,
    "OnPremisesExtensionAttributes": {
      "ExtensionAttribute1": null,
      "ExtensionAttribute10": null,
      "ExtensionAttribute11": null,
      "ExtensionAttribute12": null,
      "ExtensionAttribute13": null,
      "ExtensionAttribute14": null,
      "ExtensionAttribute15": null,
      "ExtensionAttribute2": null,
      "ExtensionAttribute3": null,
      "ExtensionAttribute4": null,
      "ExtensionAttribute5": null,
      "ExtensionAttribute6": null,
      "ExtensionAttribute7": null,
      "ExtensionAttribute8": null,
      "ExtensionAttribute9": null
    },
    "OnPremisesImmutableId": null,
    "OnPremisesLastSyncDateTime": null,
    "OnPremisesProvisioningErrors": [],
    "OnPremisesSamAccountName": null,
    "OnPremisesSecurityIdentifier": null,
    "OnPremisesSipInfo": {
      "IsSipEnabled": false,
      "SipDeploymentLocation": null,
      "SipPrimaryAddress": null
    },
    "OnPremisesSyncEnabled": null,
    "OnPremisesUserPrincipalName": null,
    "Onenote": {
      "Id": null,
      "Notebooks": null,
      "Operations": null,
      "Pages": null,
      "Resources": null,
      "SectionGroups": null,
      "Sections": null
    },
    "OnlineMeetings": null,
    "OtherMails": [],
    "Outlook": {
      "Id": null,
      "MasterCategories": null,
      "TaskFolders": null,
      "TaskGroups": null,
      "Tasks": null
    },
    "OwnedDevices": null,
    "OwnedObjects": null,
    "PasswordPolicies": null,
    "PasswordProfile": {
      "ForceChangePasswordNextSignIn": null,
      "ForceChangePasswordNextSignInWithMfa": null,
      "Password": null
    },
    "PastProjects": null,
    "PendingAccessReviewInstances": null,
    "People": null,
    "PermissionGrants": null,
    "Photo": {
      "Height": null,
      "Id": null,
      "Width": null
    },
    "Photos": null,
    "Planner": {
      "All": null,
      "FavoritePlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerFavoritePlanReferenceCollection",
      "FavoritePlans": null,
      "Id": null,
      "MyDayTasks": null,
      "Plans": null,
      "RecentPlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerRecentPlanReferenceCollection",
      "RecentPlans": null,
      "RosterPlans": null,
      "Tasks": null
    },
    "PostalCode": null,
    "PreferredDataLocation": null,
    "PreferredLanguage": null,
    "PreferredName": null,
    "Presence": {
      "Activity": null,
      "Availability": null,
      "Id": null,
      "OutOfOfficeSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphOutOfOfficeSettings",
      "StatusMessage": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPresenceStatusMessage"
    },
    "Print": {
      "RecentPrinterShares": null
    },
    "Profile": {
      "Account": null,
      "Addresses": null,
      "Anniversaries": null,
      "Awards": null,
      "Certifications": null,
      "EducationalActivities": null,
      "Emails": null,
      "Id": null,
      "Interests": null,
      "Languages": null,
      "Names": null,
      "Notes": null,
      "Patents": null,
      "Phones": null,
      "Positions": null,
      "Projects": null,
      "Publications": null,
      "Skills": null,
      "WebAccounts": null,
      "Websites": null
    },
    "ProvisionedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan"
    ],
    "ProxyAddresses": [
      "smtp:finlay.semmens@sdablueprinthybriddev.onmicrosoft.com",
      "SMTP:finlay.semmens_priv@sdablueprinthybriddev.onmicrosoft.com"
    ],
    "RefreshTokensValidFromDateTime": "2023-12-08T00:53:46Z",
    "RegisteredDevices": null,
    "Responsibilities": null,
    "Schools": null,
    "ScopedRoleMemberOf": null,
    "Security": {
      "Id": null,
      "InformationProtection": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSecurityInformationProtection"
    },
    "SecurityIdentifier": "S-1-12-1-4011686402-1270480549-2886850234-2614432679",
    "ServiceProvisioningErrors": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphServiceProvisioningError"
    ],
    "Settings": {
      "ContactMergeSuggestions": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphContactMergeSuggestions",
      "ContributionToContentDiscoveryAsOrganizationDisabled": null,
      "ContributionToContentDiscoveryDisabled": null,
      "Id": null,
      "ItemInsights": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUserInsightsSettings",
      "RegionalAndLanguageSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphRegionalAndLanguageSettings",
      "ShiftPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphShiftPreferences"
    },
    "ShowInAddressList": null,
    "SignInActivity": {
      "LastNonInteractiveSignInDateTime": null,
      "LastNonInteractiveSignInRequestId": null,
      "LastSignInDateTime": null,
      "LastSignInRequestId": null,
      "LastSuccessfulSignInDateTime": null,
      "LastSuccessfulSignInRequestId": null
    },
    "SignInSessionsValidFromDateTime": "2023-12-08T00:53:46Z",
    "Skills": null,
    "Sponsors": null,
    "State": null,
    "StreetAddress": null,
    "Surname": "Semmens",
    "Teamwork": {
      "AssociatedTeams": null,
      "Id": null,
      "InstalledApps": null,
      "Locale": null,
      "Region": null
    },
    "Todo": {
      "Id": null,
      "Lists": null
    },
    "TransitiveMemberOf": null,
    "TransitiveReports": null,
    "UsageLocation": "AU",
    "UsageRights": null,
    "UserPrincipalName": "finlay.semmens_priv@sdablueprinthybriddev.onmicrosoft.com",
    "UserType": "Member",
    "VirtualEvents": {
      "Id": null,
      "Webinars": null
    },
    "WindowsInformationProtectionDeviceRegistrations": null,
    "AdditionalProperties": {}
  },
  {
    "AboutMe": null,
    "AccountEnabled": true,
    "Activities": null,
    "AgeGroup": null,
    "AgreementAcceptances": null,
    "Analytics": {
      "ActivityStatistics": null,
      "Id": null,
      "Settings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSettings"
    },
    "AppConsentRequestsForApproval": null,
    "AppRoleAssignedResources": null,
    "AppRoleAssignments": null,
    "Approvals": null,
    "AssignedLicenses": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedLicense"
    ],
    "AssignedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan"
    ],
    "Authentication": {
      "EmailMethods": null,
      "Fido2Methods": null,
      "Id": null,
      "Methods": null,
      "MicrosoftAuthenticatorMethods": null,
      "Operations": null,
      "PasswordMethods": null,
      "PasswordlessMicrosoftAuthenticatorMethods": null,
      "PhoneMethods": null,
      "PlatformCredentialMethods": null,
      "SignInPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSignInPreferences",
      "SoftwareOathMethods": null,
      "TemporaryAccessPassMethods": null,
      "WindowsHelloForBusinessMethods": null
    },
    "AuthorizationInfo": {
      "CertificateUserIds": ""
    },
    "Birthday": null,
    "BusinessPhones": [],
    "Calendar": {
      "AllowedOnlineMeetingProviders": null,
      "CalendarGroupId": null,
      "CalendarPermissions": null,
      "CalendarView": null,
      "CanEdit": null,
      "CanShare": null,
      "CanViewPrivateItems": null,
      "ChangeKey": null,
      "Color": null,
      "DefaultOnlineMeetingProvider": null,
      "Events": null,
      "HexColor": null,
      "Id": null,
      "IsDefaultCalendar": null,
      "IsRemovable": null,
      "IsShared": null,
      "IsSharedWithMe": null,
      "IsTallyingResponses": null,
      "MultiValueExtendedProperties": null,
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphEmailAddress",
      "SingleValueExtendedProperties": null
    },
    "CalendarGroups": null,
    "CalendarView": null,
    "Calendars": null,
    "Chats": null,
    "City": null,
    "CloudPCs": null,
    "CloudRealtimeCommunicationInfo": {
      "IsSipEnabled": false
    },
    "CompanyName": null,
    "ConsentProvidedForMinor": null,
    "ContactFolders": null,
    "Contacts": null,
    "Country": null,
    "CreatedDateTime": "2023-07-31T03:42:27Z",
    "CreatedObjects": null,
    "CreationType": null,
    "CustomSecurityAttributes": {},
    "DeletedDateTime": null,
    "Department": null,
    "DeviceEnrollmentConfigurations": null,
    "DeviceEnrollmentLimit": null,
    "DeviceKeys": [],
    "DeviceManagementTroubleshootingEvents": null,
    "Devices": null,
    "DirectReports": null,
    "DisplayName": "Harry Cipolat",
    "Drive": {
      "Activities": null,
      "Bundles": null,
      "CreatedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "CreatedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "CreatedDateTime": null,
      "Description": null,
      "DriveType": null,
      "ETag": null,
      "Following": null,
      "Id": null,
      "Items": null,
      "LastModifiedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "LastModifiedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "LastModifiedDateTime": null,
      "List": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphList",
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "ParentReference": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphItemReference",
      "Quota": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphQuota",
      "Root": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphDriveItem",
      "SharePointIds": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSharepointIds",
      "Special": null,
      "System": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSystemFacet",
      "WebUrl": null
    },
    "Drives": null,
    "EmployeeExperience": {
      "Id": null,
      "LearningCourseActivities": null
    },
    "EmployeeHireDate": null,
    "EmployeeId": null,
    "EmployeeLeaveDateTime": null,
    "EmployeeOrgData": {
      "CostCenter": null,
      "Division": null
    },
    "EmployeeType": null,
    "Events": null,
    "Extensions": null,
    "ExternalUserState": null,
    "ExternalUserStateChangeDateTime": null,
    "FaxNumber": null,
    "FollowedSites": null,
    "GivenName": null,
    "HireDate": null,
    "Id": "3a47583d-e8c2-4316-ab2f-bcf6b858f4a3",
    "Identities": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphObjectIdentity"
    ],
    "ImAddresses": [],
    "InferenceClassification": {
      "Id": null,
      "Overrides": null
    },
    "InfoCatalogs": [],
    "InformationProtection": {
      "Bitlocker": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphBitlocker",
      "DataLossPreventionPolicies": null,
      "Id": null,
      "Policy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphInformationProtectionPolicy",
      "SensitivityLabels": null,
      "SensitivityPolicySettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSensitivityPolicySettings",
      "ThreatAssessmentRequests": null
    },
    "Insights": {
      "Id": null,
      "Shared": null,
      "Trending": null,
      "Used": null
    },
    "Interests": null,
    "IsLicenseReconciliationNeeded": false,
    "IsManagementRestricted": null,
    "IsResourceAccount": null,
    "JobTitle": null,
    "JoinedGroups": null,
    "JoinedTeams": null,
    "LastPasswordChangeDateTime": null,
    "LegalAgeGroupClassification": null,
    "LicenseAssignmentStates": null,
    "LicenseDetails": null,
    "Mail": "harry.cipolat_priv@sdablueprinthybriddev.onmicrosoft.com",
    "MailFolders": null,
    "MailNickname": "harry.cipolat",
    "MailboxSettings": {
      "ArchiveFolder": null,
      "AutomaticRepliesSetting": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAutomaticRepliesSetting",
      "DateFormat": null,
      "DelegateMeetingMessageDeliveryOptions": null,
      "Language": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphLocaleInfo",
      "TimeFormat": null,
      "TimeZone": null,
      "UserPurpose": null,
      "UserPurposeV2": null,
      "WorkingHours": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphWorkingHours"
    },
    "ManagedAppRegistrations": null,
    "ManagedDevices": null,
    "Manager": {
      "DeletedDateTime": null,
      "Id": null
    },
    "MemberOf": null,
    "Messages": null,
    "MobileAppIntentAndStates": null,
    "MobileAppTroubleshootingEvents": null,
    "MobilePhone": null,
    "MySite": null,
    "Notifications": null,
    "Oauth2PermissionGrants": null,
    "OfficeLocation": null,
    "OnPremisesDistinguishedName": null,
    "OnPremisesDomainName": null,
    "OnPremisesExtensionAttributes": {
      "ExtensionAttribute1": null,
      "ExtensionAttribute10": null,
      "ExtensionAttribute11": null,
      "ExtensionAttribute12": null,
      "ExtensionAttribute13": null,
      "ExtensionAttribute14": null,
      "ExtensionAttribute15": null,
      "ExtensionAttribute2": null,
      "ExtensionAttribute3": null,
      "ExtensionAttribute4": null,
      "ExtensionAttribute5": null,
      "ExtensionAttribute6": null,
      "ExtensionAttribute7": null,
      "ExtensionAttribute8": null,
      "ExtensionAttribute9": null
    },
    "OnPremisesImmutableId": null,
    "OnPremisesLastSyncDateTime": null,
    "OnPremisesProvisioningErrors": [],
    "OnPremisesSamAccountName": null,
    "OnPremisesSecurityIdentifier": null,
    "OnPremisesSipInfo": {
      "IsSipEnabled": false,
      "SipDeploymentLocation": null,
      "SipPrimaryAddress": null
    },
    "OnPremisesSyncEnabled": null,
    "OnPremisesUserPrincipalName": null,
    "Onenote": {
      "Id": null,
      "Notebooks": null,
      "Operations": null,
      "Pages": null,
      "Resources": null,
      "SectionGroups": null,
      "Sections": null
    },
    "OnlineMeetings": null,
    "OtherMails": [],
    "Outlook": {
      "Id": null,
      "MasterCategories": null,
      "TaskFolders": null,
      "TaskGroups": null,
      "Tasks": null
    },
    "OwnedDevices": null,
    "OwnedObjects": null,
    "PasswordPolicies": null,
    "PasswordProfile": {
      "ForceChangePasswordNextSignIn": null,
      "ForceChangePasswordNextSignInWithMfa": null,
      "Password": null
    },
    "PastProjects": null,
    "PendingAccessReviewInstances": null,
    "People": null,
    "PermissionGrants": null,
    "Photo": {
      "Height": null,
      "Id": null,
      "Width": null
    },
    "Photos": null,
    "Planner": {
      "All": null,
      "FavoritePlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerFavoritePlanReferenceCollection",
      "FavoritePlans": null,
      "Id": null,
      "MyDayTasks": null,
      "Plans": null,
      "RecentPlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerRecentPlanReferenceCollection",
      "RecentPlans": null,
      "RosterPlans": null,
      "Tasks": null
    },
    "PostalCode": null,
    "PreferredDataLocation": null,
    "PreferredLanguage": null,
    "PreferredName": null,
    "Presence": {
      "Activity": null,
      "Availability": null,
      "Id": null,
      "OutOfOfficeSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphOutOfOfficeSettings",
      "StatusMessage": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPresenceStatusMessage"
    },
    "Print": {
      "RecentPrinterShares": null
    },
    "Profile": {
      "Account": null,
      "Addresses": null,
      "Anniversaries": null,
      "Awards": null,
      "Certifications": null,
      "EducationalActivities": null,
      "Emails": null,
      "Id": null,
      "Interests": null,
      "Languages": null,
      "Names": null,
      "Notes": null,
      "Patents": null,
      "Phones": null,
      "Positions": null,
      "Projects": null,
      "Publications": null,
      "Skills": null,
      "WebAccounts": null,
      "Websites": null
    },
    "ProvisionedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan"
    ],
    "ProxyAddresses": [
      "smtp:harry.cipolat@sdablueprinthybriddev.onmicrosoft.com",
      "SMTP:harry.cipolat_priv@sdablueprinthybriddev.onmicrosoft.com"
    ],
    "RefreshTokensValidFromDateTime": "2024-03-07T03:56:03Z",
    "RegisteredDevices": null,
    "Responsibilities": null,
    "Schools": null,
    "ScopedRoleMemberOf": null,
    "Security": {
      "Id": null,
      "InformationProtection": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSecurityInformationProtection"
    },
    "SecurityIdentifier": "S-1-12-1-977754173-1125574850-4139528107-2750699704",
    "ServiceProvisioningErrors": [],
    "Settings": {
      "ContactMergeSuggestions": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphContactMergeSuggestions",
      "ContributionToContentDiscoveryAsOrganizationDisabled": null,
      "ContributionToContentDiscoveryDisabled": null,
      "Id": null,
      "ItemInsights": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUserInsightsSettings",
      "RegionalAndLanguageSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphRegionalAndLanguageSettings",
      "ShiftPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphShiftPreferences"
    },
    "ShowInAddressList": null,
    "SignInActivity": {
      "LastNonInteractiveSignInDateTime": null,
      "LastNonInteractiveSignInRequestId": null,
      "LastSignInDateTime": null,
      "LastSignInRequestId": null,
      "LastSuccessfulSignInDateTime": null,
      "LastSuccessfulSignInRequestId": null
    },
    "SignInSessionsValidFromDateTime": "2024-03-07T03:56:03Z",
    "Skills": null,
    "Sponsors": null,
    "State": null,
    "StreetAddress": null,
    "Surname": null,
    "Teamwork": {
      "AssociatedTeams": null,
      "Id": null,
      "InstalledApps": null,
      "Locale": null,
      "Region": null
    },
    "Todo": {
      "Id": null,
      "Lists": null
    },
    "TransitiveMemberOf": null,
    "TransitiveReports": null,
    "UsageLocation": "AU",
    "UsageRights": null,
    "UserPrincipalName": "harry.cipolat_priv@sdablueprinthybriddev.onmicrosoft.com",
    "UserType": "Member",
    "VirtualEvents": {
      "Id": null,
      "Webinars": null
    },
    "WindowsInformationProtectionDeviceRegistrations": null,
    "AdditionalProperties": {}
  },
  {
    "AboutMe": null,
    "AccountEnabled": true,
    "Activities": null,
    "AgeGroup": null,
    "AgreementAcceptances": null,
    "Analytics": {
      "ActivityStatistics": null,
      "Id": null,
      "Settings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSettings"
    },
    "AppConsentRequestsForApproval": null,
    "AppRoleAssignedResources": null,
    "AppRoleAssignments": null,
    "Approvals": null,
    "AssignedLicenses": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedLicense"
    ],
    "AssignedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan"
    ],
    "Authentication": {
      "EmailMethods": null,
      "Fido2Methods": null,
      "Id": null,
      "Methods": null,
      "MicrosoftAuthenticatorMethods": null,
      "Operations": null,
      "PasswordMethods": null,
      "PasswordlessMicrosoftAuthenticatorMethods": null,
      "PhoneMethods": null,
      "PlatformCredentialMethods": null,
      "SignInPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSignInPreferences",
      "SoftwareOathMethods": null,
      "TemporaryAccessPassMethods": null,
      "WindowsHelloForBusinessMethods": null
    },
    "AuthorizationInfo": {
      "CertificateUserIds": ""
    },
    "Birthday": null,
    "BusinessPhones": [],
    "Calendar": {
      "AllowedOnlineMeetingProviders": null,
      "CalendarGroupId": null,
      "CalendarPermissions": null,
      "CalendarView": null,
      "CanEdit": null,
      "CanShare": null,
      "CanViewPrivateItems": null,
      "ChangeKey": null,
      "Color": null,
      "DefaultOnlineMeetingProvider": null,
      "Events": null,
      "HexColor": null,
      "Id": null,
      "IsDefaultCalendar": null,
      "IsRemovable": null,
      "IsShared": null,
      "IsSharedWithMe": null,
      "IsTallyingResponses": null,
      "MultiValueExtendedProperties": null,
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphEmailAddress",
      "SingleValueExtendedProperties": null
    },
    "CalendarGroups": null,
    "CalendarView": null,
    "Calendars": null,
    "Chats": null,
    "City": null,
    "CloudPCs": null,
    "CloudRealtimeCommunicationInfo": {
      "IsSipEnabled": null
    },
    "CompanyName": null,
    "ConsentProvidedForMinor": null,
    "ContactFolders": null,
    "Contacts": null,
    "Country": null,
    "CreatedDateTime": "2024-01-16T05:01:06Z",
    "CreatedObjects": null,
    "CreationType": null,
    "CustomSecurityAttributes": {},
    "DeletedDateTime": null,
    "Department": null,
    "DeviceEnrollmentConfigurations": null,
    "DeviceEnrollmentLimit": null,
    "DeviceKeys": [],
    "DeviceManagementTroubleshootingEvents": null,
    "Devices": null,
    "DirectReports": null,
    "DisplayName": "Jayden Cooke",
    "Drive": {
      "Activities": null,
      "Bundles": null,
      "CreatedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "CreatedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "CreatedDateTime": null,
      "Description": null,
      "DriveType": null,
      "ETag": null,
      "Following": null,
      "Id": null,
      "Items": null,
      "LastModifiedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "LastModifiedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "LastModifiedDateTime": null,
      "List": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphList",
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "ParentReference": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphItemReference",
      "Quota": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphQuota",
      "Root": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphDriveItem",
      "SharePointIds": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSharepointIds",
      "Special": null,
      "System": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSystemFacet",
      "WebUrl": null
    },
    "Drives": null,
    "EmployeeExperience": {
      "Id": null,
      "LearningCourseActivities": null
    },
    "EmployeeHireDate": null,
    "EmployeeId": null,
    "EmployeeLeaveDateTime": null,
    "EmployeeOrgData": {
      "CostCenter": null,
      "Division": null
    },
    "EmployeeType": null,
    "Events": null,
    "Extensions": null,
    "ExternalUserState": null,
    "ExternalUserStateChangeDateTime": null,
    "FaxNumber": null,
    "FollowedSites": null,
    "GivenName": null,
    "HireDate": null,
    "Id": "42dfabea-a426-4b06-b393-a88ee8b6cd23",
    "Identities": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphObjectIdentity"
    ],
    "ImAddresses": [],
    "InferenceClassification": {
      "Id": null,
      "Overrides": null
    },
    "InfoCatalogs": [],
    "InformationProtection": {
      "Bitlocker": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphBitlocker",
      "DataLossPreventionPolicies": null,
      "Id": null,
      "Policy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphInformationProtectionPolicy",
      "SensitivityLabels": null,
      "SensitivityPolicySettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSensitivityPolicySettings",
      "ThreatAssessmentRequests": null
    },
    "Insights": {
      "Id": null,
      "Shared": null,
      "Trending": null,
      "Used": null
    },
    "Interests": null,
    "IsLicenseReconciliationNeeded": false,
    "IsManagementRestricted": null,
    "IsResourceAccount": null,
    "JobTitle": null,
    "JoinedGroups": null,
    "JoinedTeams": null,
    "LastPasswordChangeDateTime": null,
    "LegalAgeGroupClassification": null,
    "LicenseAssignmentStates": null,
    "LicenseDetails": null,
    "Mail": "jayden.cooke_priv@sdablueprinthybriddev.onmicrosoft.com",
    "MailFolders": null,
    "MailNickname": "jayden.cooke_priv",
    "MailboxSettings": {
      "ArchiveFolder": null,
      "AutomaticRepliesSetting": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAutomaticRepliesSetting",
      "DateFormat": null,
      "DelegateMeetingMessageDeliveryOptions": null,
      "Language": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphLocaleInfo",
      "TimeFormat": null,
      "TimeZone": null,
      "UserPurpose": null,
      "UserPurposeV2": null,
      "WorkingHours": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphWorkingHours"
    },
    "ManagedAppRegistrations": null,
    "ManagedDevices": null,
    "Manager": {
      "DeletedDateTime": null,
      "Id": null
    },
    "MemberOf": null,
    "Messages": null,
    "MobileAppIntentAndStates": null,
    "MobileAppTroubleshootingEvents": null,
    "MobilePhone": null,
    "MySite": null,
    "Notifications": null,
    "Oauth2PermissionGrants": null,
    "OfficeLocation": null,
    "OnPremisesDistinguishedName": null,
    "OnPremisesDomainName": null,
    "OnPremisesExtensionAttributes": {
      "ExtensionAttribute1": null,
      "ExtensionAttribute10": null,
      "ExtensionAttribute11": null,
      "ExtensionAttribute12": null,
      "ExtensionAttribute13": null,
      "ExtensionAttribute14": null,
      "ExtensionAttribute15": null,
      "ExtensionAttribute2": null,
      "ExtensionAttribute3": null,
      "ExtensionAttribute4": null,
      "ExtensionAttribute5": null,
      "ExtensionAttribute6": null,
      "ExtensionAttribute7": null,
      "ExtensionAttribute8": null,
      "ExtensionAttribute9": null
    },
    "OnPremisesImmutableId": null,
    "OnPremisesLastSyncDateTime": null,
    "OnPremisesProvisioningErrors": [],
    "OnPremisesSamAccountName": null,
    "OnPremisesSecurityIdentifier": null,
    "OnPremisesSipInfo": {
      "IsSipEnabled": false,
      "SipDeploymentLocation": null,
      "SipPrimaryAddress": null
    },
    "OnPremisesSyncEnabled": null,
    "OnPremisesUserPrincipalName": null,
    "Onenote": {
      "Id": null,
      "Notebooks": null,
      "Operations": null,
      "Pages": null,
      "Resources": null,
      "SectionGroups": null,
      "Sections": null
    },
    "OnlineMeetings": null,
    "OtherMails": [],
    "Outlook": {
      "Id": null,
      "MasterCategories": null,
      "TaskFolders": null,
      "TaskGroups": null,
      "Tasks": null
    },
    "OwnedDevices": null,
    "OwnedObjects": null,
    "PasswordPolicies": null,
    "PasswordProfile": {
      "ForceChangePasswordNextSignIn": null,
      "ForceChangePasswordNextSignInWithMfa": null,
      "Password": null
    },
    "PastProjects": null,
    "PendingAccessReviewInstances": null,
    "People": null,
    "PermissionGrants": null,
    "Photo": {
      "Height": null,
      "Id": null,
      "Width": null
    },
    "Photos": null,
    "Planner": {
      "All": null,
      "FavoritePlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerFavoritePlanReferenceCollection",
      "FavoritePlans": null,
      "Id": null,
      "MyDayTasks": null,
      "Plans": null,
      "RecentPlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerRecentPlanReferenceCollection",
      "RecentPlans": null,
      "RosterPlans": null,
      "Tasks": null
    },
    "PostalCode": null,
    "PreferredDataLocation": null,
    "PreferredLanguage": null,
    "PreferredName": null,
    "Presence": {
      "Activity": null,
      "Availability": null,
      "Id": null,
      "OutOfOfficeSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphOutOfOfficeSettings",
      "StatusMessage": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPresenceStatusMessage"
    },
    "Print": {
      "RecentPrinterShares": null
    },
    "Profile": {
      "Account": null,
      "Addresses": null,
      "Anniversaries": null,
      "Awards": null,
      "Certifications": null,
      "EducationalActivities": null,
      "Emails": null,
      "Id": null,
      "Interests": null,
      "Languages": null,
      "Names": null,
      "Notes": null,
      "Patents": null,
      "Phones": null,
      "Positions": null,
      "Projects": null,
      "Publications": null,
      "Skills": null,
      "WebAccounts": null,
      "Websites": null
    },
    "ProvisionedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan"
    ],
    "ProxyAddresses": [
      "SMTP:jayden.cooke_priv@sdablueprinthybriddev.onmicrosoft.com"
    ],
    "RefreshTokensValidFromDateTime": "2024-01-16T21:19:54Z",
    "RegisteredDevices": null,
    "Responsibilities": null,
    "Schools": null,
    "ScopedRoleMemberOf": null,
    "Security": {
      "Id": null,
      "InformationProtection": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSecurityInformationProtection"
    },
    "SecurityIdentifier": "S-1-12-1-1121954794-1258726438-2393412531-600684264",
    "ServiceProvisioningErrors": [],
    "Settings": {
      "ContactMergeSuggestions": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphContactMergeSuggestions",
      "ContributionToContentDiscoveryAsOrganizationDisabled": null,
      "ContributionToContentDiscoveryDisabled": null,
      "Id": null,
      "ItemInsights": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUserInsightsSettings",
      "RegionalAndLanguageSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphRegionalAndLanguageSettings",
      "ShiftPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphShiftPreferences"
    },
    "ShowInAddressList": null,
    "SignInActivity": {
      "LastNonInteractiveSignInDateTime": null,
      "LastNonInteractiveSignInRequestId": null,
      "LastSignInDateTime": null,
      "LastSignInRequestId": null,
      "LastSuccessfulSignInDateTime": null,
      "LastSuccessfulSignInRequestId": null
    },
    "SignInSessionsValidFromDateTime": "2024-01-16T21:19:54Z",
    "Skills": null,
    "Sponsors": null,
    "State": null,
    "StreetAddress": null,
    "Surname": null,
    "Teamwork": {
      "AssociatedTeams": null,
      "Id": null,
      "InstalledApps": null,
      "Locale": null,
      "Region": null
    },
    "Todo": {
      "Id": null,
      "Lists": null
    },
    "TransitiveMemberOf": null,
    "TransitiveReports": null,
    "UsageLocation": "AU",
    "UsageRights": null,
    "UserPrincipalName": "jayden.cooke_priv@sdablueprinthybriddev.onmicrosoft.com",
    "UserType": "Member",
    "VirtualEvents": {
      "Id": null,
      "Webinars": null
    },
    "WindowsInformationProtectionDeviceRegistrations": null,
    "AdditionalProperties": {}
  },
  {
    "AboutMe": null,
    "AccountEnabled": true,
    "Activities": null,
    "AgeGroup": null,
    "AgreementAcceptances": null,
    "Analytics": {
      "ActivityStatistics": null,
      "Id": null,
      "Settings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSettings"
    },
    "AppConsentRequestsForApproval": null,
    "AppRoleAssignedResources": null,
    "AppRoleAssignments": null,
    "Approvals": null,
    "AssignedLicenses": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedLicense",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedLicense"
    ],
    "AssignedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan"
    ],
    "Authentication": {
      "EmailMethods": null,
      "Fido2Methods": null,
      "Id": null,
      "Methods": null,
      "MicrosoftAuthenticatorMethods": null,
      "Operations": null,
      "PasswordMethods": null,
      "PasswordlessMicrosoftAuthenticatorMethods": null,
      "PhoneMethods": null,
      "PlatformCredentialMethods": null,
      "SignInPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSignInPreferences",
      "SoftwareOathMethods": null,
      "TemporaryAccessPassMethods": null,
      "WindowsHelloForBusinessMethods": null
    },
    "AuthorizationInfo": {
      "CertificateUserIds": ""
    },
    "Birthday": null,
    "BusinessPhones": [
      "0251300149"
    ],
    "Calendar": {
      "AllowedOnlineMeetingProviders": null,
      "CalendarGroupId": null,
      "CalendarPermissions": null,
      "CalendarView": null,
      "CanEdit": null,
      "CanShare": null,
      "CanViewPrivateItems": null,
      "ChangeKey": null,
      "Color": null,
      "DefaultOnlineMeetingProvider": null,
      "Events": null,
      "HexColor": null,
      "Id": null,
      "IsDefaultCalendar": null,
      "IsRemovable": null,
      "IsShared": null,
      "IsSharedWithMe": null,
      "IsTallyingResponses": null,
      "MultiValueExtendedProperties": null,
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphEmailAddress",
      "SingleValueExtendedProperties": null
    },
    "CalendarGroups": null,
    "CalendarView": null,
    "Calendars": null,
    "Chats": null,
    "City": null,
    "CloudPCs": null,
    "CloudRealtimeCommunicationInfo": {
      "IsSipEnabled": true
    },
    "CompanyName": null,
    "ConsentProvidedForMinor": null,
    "ContactFolders": null,
    "Contacts": null,
    "Country": "AU",
    "CreatedDateTime": "2023-07-20T04:20:22Z",
    "CreatedObjects": null,
    "CreationType": null,
    "CustomSecurityAttributes": {},
    "DeletedDateTime": null,
    "Department": null,
    "DeviceEnrollmentConfigurations": null,
    "DeviceEnrollmentLimit": null,
    "DeviceKeys": [],
    "DeviceManagementTroubleshootingEvents": null,
    "Devices": null,
    "DirectReports": null,
    "DisplayName": "Joel Ramsay",
    "Drive": {
      "Activities": null,
      "Bundles": null,
      "CreatedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "CreatedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "CreatedDateTime": null,
      "Description": null,
      "DriveType": null,
      "ETag": null,
      "Following": null,
      "Id": null,
      "Items": null,
      "LastModifiedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "LastModifiedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "LastModifiedDateTime": null,
      "List": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphList",
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "ParentReference": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphItemReference",
      "Quota": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphQuota",
      "Root": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphDriveItem",
      "SharePointIds": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSharepointIds",
      "Special": null,
      "System": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSystemFacet",
      "WebUrl": null
    },
    "Drives": null,
    "EmployeeExperience": {
      "Id": null,
      "LearningCourseActivities": null
    },
    "EmployeeHireDate": null,
    "EmployeeId": null,
    "EmployeeLeaveDateTime": null,
    "EmployeeOrgData": {
      "CostCenter": null,
      "Division": null
    },
    "EmployeeType": null,
    "Events": null,
    "Extensions": null,
    "ExternalUserState": null,
    "ExternalUserStateChangeDateTime": null,
    "FaxNumber": null,
    "FollowedSites": null,
    "GivenName": "Joel",
    "HireDate": null,
    "Id": "76f4875e-9d45-4e27-ab14-700bc0184da8",
    "Identities": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphObjectIdentity"
    ],
    "ImAddresses": [
      "joel.ramsay_priv@sdablueprinthybriddev.onmicrosoft.com"
    ],
    "InferenceClassification": {
      "Id": null,
      "Overrides": null
    },
    "InfoCatalogs": [],
    "InformationProtection": {
      "Bitlocker": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphBitlocker",
      "DataLossPreventionPolicies": null,
      "Id": null,
      "Policy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphInformationProtectionPolicy",
      "SensitivityLabels": null,
      "SensitivityPolicySettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSensitivityPolicySettings",
      "ThreatAssessmentRequests": null
    },
    "Insights": {
      "Id": null,
      "Shared": null,
      "Trending": null,
      "Used": null
    },
    "Interests": null,
    "IsLicenseReconciliationNeeded": false,
    "IsManagementRestricted": null,
    "IsResourceAccount": null,
    "JobTitle": null,
    "JoinedGroups": null,
    "JoinedTeams": null,
    "LastPasswordChangeDateTime": null,
    "LegalAgeGroupClassification": null,
    "LicenseAssignmentStates": null,
    "LicenseDetails": null,
    "Mail": "joel.ramsay_priv@sdablueprinthybriddev.onmicrosoft.com",
    "MailFolders": null,
    "MailNickname": "joel.ramsay",
    "MailboxSettings": {
      "ArchiveFolder": null,
      "AutomaticRepliesSetting": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAutomaticRepliesSetting",
      "DateFormat": null,
      "DelegateMeetingMessageDeliveryOptions": null,
      "Language": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphLocaleInfo",
      "TimeFormat": null,
      "TimeZone": null,
      "UserPurpose": null,
      "UserPurposeV2": null,
      "WorkingHours": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphWorkingHours"
    },
    "ManagedAppRegistrations": null,
    "ManagedDevices": null,
    "Manager": {
      "DeletedDateTime": null,
      "Id": null
    },
    "MemberOf": null,
    "Messages": null,
    "MobileAppIntentAndStates": null,
    "MobileAppTroubleshootingEvents": null,
    "MobilePhone": null,
    "MySite": null,
    "Notifications": null,
    "Oauth2PermissionGrants": null,
    "OfficeLocation": null,
    "OnPremisesDistinguishedName": null,
    "OnPremisesDomainName": null,
    "OnPremisesExtensionAttributes": {
      "ExtensionAttribute1": null,
      "ExtensionAttribute10": null,
      "ExtensionAttribute11": null,
      "ExtensionAttribute12": null,
      "ExtensionAttribute13": null,
      "ExtensionAttribute14": null,
      "ExtensionAttribute15": null,
      "ExtensionAttribute2": null,
      "ExtensionAttribute3": null,
      "ExtensionAttribute4": null,
      "ExtensionAttribute5": null,
      "ExtensionAttribute6": null,
      "ExtensionAttribute7": null,
      "ExtensionAttribute8": null,
      "ExtensionAttribute9": null
    },
    "OnPremisesImmutableId": null,
    "OnPremisesLastSyncDateTime": null,
    "OnPremisesProvisioningErrors": [],
    "OnPremisesSamAccountName": null,
    "OnPremisesSecurityIdentifier": null,
    "OnPremisesSipInfo": {
      "IsSipEnabled": false,
      "SipDeploymentLocation": null,
      "SipPrimaryAddress": null
    },
    "OnPremisesSyncEnabled": null,
    "OnPremisesUserPrincipalName": null,
    "Onenote": {
      "Id": null,
      "Notebooks": null,
      "Operations": null,
      "Pages": null,
      "Resources": null,
      "SectionGroups": null,
      "Sections": null
    },
    "OnlineMeetings": null,
    "OtherMails": [
      "joel.ramsay@asd.gov.au"
    ],
    "Outlook": {
      "Id": null,
      "MasterCategories": null,
      "TaskFolders": null,
      "TaskGroups": null,
      "Tasks": null
    },
    "OwnedDevices": null,
    "OwnedObjects": null,
    "PasswordPolicies": null,
    "PasswordProfile": {
      "ForceChangePasswordNextSignIn": null,
      "ForceChangePasswordNextSignInWithMfa": null,
      "Password": null
    },
    "PastProjects": null,
    "PendingAccessReviewInstances": null,
    "People": null,
    "PermissionGrants": null,
    "Photo": {
      "Height": null,
      "Id": null,
      "Width": null
    },
    "Photos": null,
    "Planner": {
      "All": null,
      "FavoritePlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerFavoritePlanReferenceCollection",
      "FavoritePlans": null,
      "Id": null,
      "MyDayTasks": null,
      "Plans": null,
      "RecentPlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerRecentPlanReferenceCollection",
      "RecentPlans": null,
      "RosterPlans": null,
      "Tasks": null
    },
    "PostalCode": null,
    "PreferredDataLocation": null,
    "PreferredLanguage": "en",
    "PreferredName": null,
    "Presence": {
      "Activity": null,
      "Availability": null,
      "Id": null,
      "OutOfOfficeSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphOutOfOfficeSettings",
      "StatusMessage": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPresenceStatusMessage"
    },
    "Print": {
      "RecentPrinterShares": null
    },
    "Profile": {
      "Account": null,
      "Addresses": null,
      "Anniversaries": null,
      "Awards": null,
      "Certifications": null,
      "EducationalActivities": null,
      "Emails": null,
      "Id": null,
      "Interests": null,
      "Languages": null,
      "Names": null,
      "Notes": null,
      "Patents": null,
      "Phones": null,
      "Positions": null,
      "Projects": null,
      "Publications": null,
      "Skills": null,
      "WebAccounts": null,
      "Websites": null
    },
    "ProvisionedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan"
    ],
    "ProxyAddresses": [
      "smtp:joel.ramsay@sdablueprinthybriddev.onmicrosoft.com",
      "SMTP:joel.ramsay_priv@sdablueprinthybriddev.onmicrosoft.com"
    ],
    "RefreshTokensValidFromDateTime": "2024-01-15T04:42:03Z",
    "RegisteredDevices": null,
    "Responsibilities": null,
    "Schools": null,
    "ScopedRoleMemberOf": null,
    "Security": {
      "Id": null,
      "InformationProtection": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSecurityInformationProtection"
    },
    "SecurityIdentifier": "S-1-12-1-1995736926-1311219013-191894699-2823624896",
    "ServiceProvisioningErrors": [],
    "Settings": {
      "ContactMergeSuggestions": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphContactMergeSuggestions",
      "ContributionToContentDiscoveryAsOrganizationDisabled": null,
      "ContributionToContentDiscoveryDisabled": null,
      "Id": null,
      "ItemInsights": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUserInsightsSettings",
      "RegionalAndLanguageSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphRegionalAndLanguageSettings",
      "ShiftPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphShiftPreferences"
    },
    "ShowInAddressList": null,
    "SignInActivity": {
      "LastNonInteractiveSignInDateTime": null,
      "LastNonInteractiveSignInRequestId": null,
      "LastSignInDateTime": null,
      "LastSignInRequestId": null,
      "LastSuccessfulSignInDateTime": null,
      "LastSuccessfulSignInRequestId": null
    },
    "SignInSessionsValidFromDateTime": "2024-01-15T04:42:03Z",
    "Skills": null,
    "Sponsors": null,
    "State": null,
    "StreetAddress": null,
    "Surname": "Ramsay",
    "Teamwork": {
      "AssociatedTeams": null,
      "Id": null,
      "InstalledApps": null,
      "Locale": null,
      "Region": null
    },
    "Todo": {
      "Id": null,
      "Lists": null
    },
    "TransitiveMemberOf": null,
    "TransitiveReports": null,
    "UsageLocation": "AU",
    "UsageRights": null,
    "UserPrincipalName": "joel.ramsay_priv@sdablueprinthybriddev.onmicrosoft.com",
    "UserType": "Member",
    "VirtualEvents": {
      "Id": null,
      "Webinars": null
    },
    "WindowsInformationProtectionDeviceRegistrations": null,
    "AdditionalProperties": {}
  },
  {
    "AboutMe": null,
    "AccountEnabled": false,
    "Activities": null,
    "AgeGroup": null,
    "AgreementAcceptances": null,
    "Analytics": {
      "ActivityStatistics": null,
      "Id": null,
      "Settings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSettings"
    },
    "AppConsentRequestsForApproval": null,
    "AppRoleAssignedResources": null,
    "AppRoleAssignments": null,
    "Approvals": null,
    "AssignedLicenses": [],
    "AssignedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan"
    ],
    "Authentication": {
      "EmailMethods": null,
      "Fido2Methods": null,
      "Id": null,
      "Methods": null,
      "MicrosoftAuthenticatorMethods": null,
      "Operations": null,
      "PasswordMethods": null,
      "PasswordlessMicrosoftAuthenticatorMethods": null,
      "PhoneMethods": null,
      "PlatformCredentialMethods": null,
      "SignInPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSignInPreferences",
      "SoftwareOathMethods": null,
      "TemporaryAccessPassMethods": null,
      "WindowsHelloForBusinessMethods": null
    },
    "AuthorizationInfo": {
      "CertificateUserIds": ""
    },
    "Birthday": null,
    "BusinessPhones": [],
    "Calendar": {
      "AllowedOnlineMeetingProviders": null,
      "CalendarGroupId": null,
      "CalendarPermissions": null,
      "CalendarView": null,
      "CanEdit": null,
      "CanShare": null,
      "CanViewPrivateItems": null,
      "ChangeKey": null,
      "Color": null,
      "DefaultOnlineMeetingProvider": null,
      "Events": null,
      "HexColor": null,
      "Id": null,
      "IsDefaultCalendar": null,
      "IsRemovable": null,
      "IsShared": null,
      "IsSharedWithMe": null,
      "IsTallyingResponses": null,
      "MultiValueExtendedProperties": null,
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphEmailAddress",
      "SingleValueExtendedProperties": null
    },
    "CalendarGroups": null,
    "CalendarView": null,
    "Calendars": null,
    "Chats": null,
    "City": null,
    "CloudPCs": null,
    "CloudRealtimeCommunicationInfo": {
      "IsSipEnabled": null
    },
    "CompanyName": null,
    "ConsentProvidedForMinor": null,
    "ContactFolders": null,
    "Contacts": null,
    "Country": null,
    "CreatedDateTime": "2023-09-12T01:36:20Z",
    "CreatedObjects": null,
    "CreationType": null,
    "CustomSecurityAttributes": {},
    "DeletedDateTime": null,
    "Department": null,
    "DeviceEnrollmentConfigurations": null,
    "DeviceEnrollmentLimit": null,
    "DeviceKeys": [],
    "DeviceManagementTroubleshootingEvents": null,
    "Devices": null,
    "DirectReports": null,
    "DisplayName": "Matt Wiscombe",
    "Drive": {
      "Activities": null,
      "Bundles": null,
      "CreatedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "CreatedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "CreatedDateTime": null,
      "Description": null,
      "DriveType": null,
      "ETag": null,
      "Following": null,
      "Id": null,
      "Items": null,
      "LastModifiedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "LastModifiedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "LastModifiedDateTime": null,
      "List": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphList",
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "ParentReference": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphItemReference",
      "Quota": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphQuota",
      "Root": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphDriveItem",
      "SharePointIds": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSharepointIds",
      "Special": null,
      "System": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSystemFacet",
      "WebUrl": null
    },
    "Drives": null,
    "EmployeeExperience": {
      "Id": null,
      "LearningCourseActivities": null
    },
    "EmployeeHireDate": null,
    "EmployeeId": null,
    "EmployeeLeaveDateTime": null,
    "EmployeeOrgData": {
      "CostCenter": null,
      "Division": null
    },
    "EmployeeType": null,
    "Events": null,
    "Extensions": null,
    "ExternalUserState": null,
    "ExternalUserStateChangeDateTime": null,
    "FaxNumber": null,
    "FollowedSites": null,
    "GivenName": null,
    "HireDate": null,
    "Id": "0889b792-d5f0-4964-a31a-8f1e8308f517",
    "Identities": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphObjectIdentity"
    ],
    "ImAddresses": [],
    "InferenceClassification": {
      "Id": null,
      "Overrides": null
    },
    "InfoCatalogs": [],
    "InformationProtection": {
      "Bitlocker": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphBitlocker",
      "DataLossPreventionPolicies": null,
      "Id": null,
      "Policy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphInformationProtectionPolicy",
      "SensitivityLabels": null,
      "SensitivityPolicySettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSensitivityPolicySettings",
      "ThreatAssessmentRequests": null
    },
    "Insights": {
      "Id": null,
      "Shared": null,
      "Trending": null,
      "Used": null
    },
    "Interests": null,
    "IsLicenseReconciliationNeeded": false,
    "IsManagementRestricted": null,
    "IsResourceAccount": null,
    "JobTitle": null,
    "JoinedGroups": null,
    "JoinedTeams": null,
    "LastPasswordChangeDateTime": null,
    "LegalAgeGroupClassification": null,
    "LicenseAssignmentStates": null,
    "LicenseDetails": null,
    "Mail": null,
    "MailFolders": null,
    "MailNickname": "matt.wiscombe_priv",
    "MailboxSettings": {
      "ArchiveFolder": null,
      "AutomaticRepliesSetting": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAutomaticRepliesSetting",
      "DateFormat": null,
      "DelegateMeetingMessageDeliveryOptions": null,
      "Language": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphLocaleInfo",
      "TimeFormat": null,
      "TimeZone": null,
      "UserPurpose": null,
      "UserPurposeV2": null,
      "WorkingHours": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphWorkingHours"
    },
    "ManagedAppRegistrations": null,
    "ManagedDevices": null,
    "Manager": {
      "DeletedDateTime": null,
      "Id": null
    },
    "MemberOf": null,
    "Messages": null,
    "MobileAppIntentAndStates": null,
    "MobileAppTroubleshootingEvents": null,
    "MobilePhone": null,
    "MySite": null,
    "Notifications": null,
    "Oauth2PermissionGrants": null,
    "OfficeLocation": null,
    "OnPremisesDistinguishedName": null,
    "OnPremisesDomainName": null,
    "OnPremisesExtensionAttributes": {
      "ExtensionAttribute1": null,
      "ExtensionAttribute10": null,
      "ExtensionAttribute11": null,
      "ExtensionAttribute12": null,
      "ExtensionAttribute13": null,
      "ExtensionAttribute14": null,
      "ExtensionAttribute15": null,
      "ExtensionAttribute2": null,
      "ExtensionAttribute3": null,
      "ExtensionAttribute4": null,
      "ExtensionAttribute5": null,
      "ExtensionAttribute6": null,
      "ExtensionAttribute7": null,
      "ExtensionAttribute8": null,
      "ExtensionAttribute9": null
    },
    "OnPremisesImmutableId": null,
    "OnPremisesLastSyncDateTime": null,
    "OnPremisesProvisioningErrors": [],
    "OnPremisesSamAccountName": null,
    "OnPremisesSecurityIdentifier": null,
    "OnPremisesSipInfo": {
      "IsSipEnabled": false,
      "SipDeploymentLocation": null,
      "SipPrimaryAddress": null
    },
    "OnPremisesSyncEnabled": null,
    "OnPremisesUserPrincipalName": null,
    "Onenote": {
      "Id": null,
      "Notebooks": null,
      "Operations": null,
      "Pages": null,
      "Resources": null,
      "SectionGroups": null,
      "Sections": null
    },
    "OnlineMeetings": null,
    "OtherMails": [],
    "Outlook": {
      "Id": null,
      "MasterCategories": null,
      "TaskFolders": null,
      "TaskGroups": null,
      "Tasks": null
    },
    "OwnedDevices": null,
    "OwnedObjects": null,
    "PasswordPolicies": null,
    "PasswordProfile": {
      "ForceChangePasswordNextSignIn": null,
      "ForceChangePasswordNextSignInWithMfa": null,
      "Password": null
    },
    "PastProjects": null,
    "PendingAccessReviewInstances": null,
    "People": null,
    "PermissionGrants": null,
    "Photo": {
      "Height": null,
      "Id": null,
      "Width": null
    },
    "Photos": null,
    "Planner": {
      "All": null,
      "FavoritePlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerFavoritePlanReferenceCollection",
      "FavoritePlans": null,
      "Id": null,
      "MyDayTasks": null,
      "Plans": null,
      "RecentPlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerRecentPlanReferenceCollection",
      "RecentPlans": null,
      "RosterPlans": null,
      "Tasks": null
    },
    "PostalCode": null,
    "PreferredDataLocation": null,
    "PreferredLanguage": null,
    "PreferredName": null,
    "Presence": {
      "Activity": null,
      "Availability": null,
      "Id": null,
      "OutOfOfficeSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphOutOfOfficeSettings",
      "StatusMessage": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPresenceStatusMessage"
    },
    "Print": {
      "RecentPrinterShares": null
    },
    "Profile": {
      "Account": null,
      "Addresses": null,
      "Anniversaries": null,
      "Awards": null,
      "Certifications": null,
      "EducationalActivities": null,
      "Emails": null,
      "Id": null,
      "Interests": null,
      "Languages": null,
      "Names": null,
      "Notes": null,
      "Patents": null,
      "Phones": null,
      "Positions": null,
      "Projects": null,
      "Publications": null,
      "Skills": null,
      "WebAccounts": null,
      "Websites": null
    },
    "ProvisionedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan"
    ],
    "ProxyAddresses": [],
    "RefreshTokensValidFromDateTime": "2023-09-12T01:41:22Z",
    "RegisteredDevices": null,
    "Responsibilities": null,
    "Schools": null,
    "ScopedRoleMemberOf": null,
    "Security": {
      "Id": null,
      "InformationProtection": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSecurityInformationProtection"
    },
    "SecurityIdentifier": "S-1-12-1-143243154-1231345136-512694947-401934467",
    "ServiceProvisioningErrors": [],
    "Settings": {
      "ContactMergeSuggestions": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphContactMergeSuggestions",
      "ContributionToContentDiscoveryAsOrganizationDisabled": null,
      "ContributionToContentDiscoveryDisabled": null,
      "Id": null,
      "ItemInsights": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUserInsightsSettings",
      "RegionalAndLanguageSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphRegionalAndLanguageSettings",
      "ShiftPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphShiftPreferences"
    },
    "ShowInAddressList": null,
    "SignInActivity": {
      "LastNonInteractiveSignInDateTime": null,
      "LastNonInteractiveSignInRequestId": null,
      "LastSignInDateTime": null,
      "LastSignInRequestId": null,
      "LastSuccessfulSignInDateTime": null,
      "LastSuccessfulSignInRequestId": null
    },
    "SignInSessionsValidFromDateTime": "2023-09-12T01:41:22Z",
    "Skills": null,
    "Sponsors": null,
    "State": null,
    "StreetAddress": null,
    "Surname": null,
    "Teamwork": {
      "AssociatedTeams": null,
      "Id": null,
      "InstalledApps": null,
      "Locale": null,
      "Region": null
    },
    "Todo": {
      "Id": null,
      "Lists": null
    },
    "TransitiveMemberOf": null,
    "TransitiveReports": null,
    "UsageLocation": "AU",
    "UsageRights": null,
    "UserPrincipalName": "matt.wiscombe_priv@sdablueprinthybriddev.onmicrosoft.com",
    "UserType": "Member",
    "VirtualEvents": {
      "Id": null,
      "Webinars": null
    },
    "WindowsInformationProtectionDeviceRegistrations": null,
    "AdditionalProperties": {}
  },
  {
    "AboutMe": null,
    "AccountEnabled": true,
    "Activities": null,
    "AgeGroup": null,
    "AgreementAcceptances": null,
    "Analytics": {
      "ActivityStatistics": null,
      "Id": null,
      "Settings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSettings"
    },
    "AppConsentRequestsForApproval": null,
    "AppRoleAssignedResources": null,
    "AppRoleAssignments": null,
    "Approvals": null,
    "AssignedLicenses": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedLicense"
    ],
    "AssignedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan"
    ],
    "Authentication": {
      "EmailMethods": null,
      "Fido2Methods": null,
      "Id": null,
      "Methods": null,
      "MicrosoftAuthenticatorMethods": null,
      "Operations": null,
      "PasswordMethods": null,
      "PasswordlessMicrosoftAuthenticatorMethods": null,
      "PhoneMethods": null,
      "PlatformCredentialMethods": null,
      "SignInPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSignInPreferences",
      "SoftwareOathMethods": null,
      "TemporaryAccessPassMethods": null,
      "WindowsHelloForBusinessMethods": null
    },
    "AuthorizationInfo": {
      "CertificateUserIds": ""
    },
    "Birthday": null,
    "BusinessPhones": [],
    "Calendar": {
      "AllowedOnlineMeetingProviders": null,
      "CalendarGroupId": null,
      "CalendarPermissions": null,
      "CalendarView": null,
      "CanEdit": null,
      "CanShare": null,
      "CanViewPrivateItems": null,
      "ChangeKey": null,
      "Color": null,
      "DefaultOnlineMeetingProvider": null,
      "Events": null,
      "HexColor": null,
      "Id": null,
      "IsDefaultCalendar": null,
      "IsRemovable": null,
      "IsShared": null,
      "IsSharedWithMe": null,
      "IsTallyingResponses": null,
      "MultiValueExtendedProperties": null,
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphEmailAddress",
      "SingleValueExtendedProperties": null
    },
    "CalendarGroups": null,
    "CalendarView": null,
    "Calendars": null,
    "Chats": null,
    "City": null,
    "CloudPCs": null,
    "CloudRealtimeCommunicationInfo": {
      "IsSipEnabled": null
    },
    "CompanyName": null,
    "ConsentProvidedForMinor": null,
    "ContactFolders": null,
    "Contacts": null,
    "Country": null,
    "CreatedDateTime": "2024-01-17T01:33:18Z",
    "CreatedObjects": null,
    "CreationType": null,
    "CustomSecurityAttributes": {},
    "DeletedDateTime": null,
    "Department": null,
    "DeviceEnrollmentConfigurations": null,
    "DeviceEnrollmentLimit": null,
    "DeviceKeys": [],
    "DeviceManagementTroubleshootingEvents": null,
    "Devices": null,
    "DirectReports": null,
    "DisplayName": "Ryan Baker",
    "Drive": {
      "Activities": null,
      "Bundles": null,
      "CreatedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "CreatedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "CreatedDateTime": null,
      "Description": null,
      "DriveType": null,
      "ETag": null,
      "Following": null,
      "Id": null,
      "Items": null,
      "LastModifiedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "LastModifiedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "LastModifiedDateTime": null,
      "List": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphList",
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "ParentReference": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphItemReference",
      "Quota": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphQuota",
      "Root": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphDriveItem",
      "SharePointIds": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSharepointIds",
      "Special": null,
      "System": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSystemFacet",
      "WebUrl": null
    },
    "Drives": null,
    "EmployeeExperience": {
      "Id": null,
      "LearningCourseActivities": null
    },
    "EmployeeHireDate": null,
    "EmployeeId": null,
    "EmployeeLeaveDateTime": null,
    "EmployeeOrgData": {
      "CostCenter": null,
      "Division": null
    },
    "EmployeeType": null,
    "Events": null,
    "Extensions": null,
    "ExternalUserState": null,
    "ExternalUserStateChangeDateTime": null,
    "FaxNumber": null,
    "FollowedSites": null,
    "GivenName": null,
    "HireDate": null,
    "Id": "519e9816-58fd-4264-996d-26c81d5f8229",
    "Identities": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphObjectIdentity"
    ],
    "ImAddresses": [],
    "InferenceClassification": {
      "Id": null,
      "Overrides": null
    },
    "InfoCatalogs": [],
    "InformationProtection": {
      "Bitlocker": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphBitlocker",
      "DataLossPreventionPolicies": null,
      "Id": null,
      "Policy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphInformationProtectionPolicy",
      "SensitivityLabels": null,
      "SensitivityPolicySettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSensitivityPolicySettings",
      "ThreatAssessmentRequests": null
    },
    "Insights": {
      "Id": null,
      "Shared": null,
      "Trending": null,
      "Used": null
    },
    "Interests": null,
    "IsLicenseReconciliationNeeded": false,
    "IsManagementRestricted": null,
    "IsResourceAccount": null,
    "JobTitle": null,
    "JoinedGroups": null,
    "JoinedTeams": null,
    "LastPasswordChangeDateTime": null,
    "LegalAgeGroupClassification": null,
    "LicenseAssignmentStates": null,
    "LicenseDetails": null,
    "Mail": "ryan.baker_Priv@sdablueprinthybriddev.onmicrosoft.com",
    "MailFolders": null,
    "MailNickname": "ryan.baker_Priv",
    "MailboxSettings": {
      "ArchiveFolder": null,
      "AutomaticRepliesSetting": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAutomaticRepliesSetting",
      "DateFormat": null,
      "DelegateMeetingMessageDeliveryOptions": null,
      "Language": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphLocaleInfo",
      "TimeFormat": null,
      "TimeZone": null,
      "UserPurpose": null,
      "UserPurposeV2": null,
      "WorkingHours": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphWorkingHours"
    },
    "ManagedAppRegistrations": null,
    "ManagedDevices": null,
    "Manager": {
      "DeletedDateTime": null,
      "Id": null
    },
    "MemberOf": null,
    "Messages": null,
    "MobileAppIntentAndStates": null,
    "MobileAppTroubleshootingEvents": null,
    "MobilePhone": null,
    "MySite": null,
    "Notifications": null,
    "Oauth2PermissionGrants": null,
    "OfficeLocation": null,
    "OnPremisesDistinguishedName": null,
    "OnPremisesDomainName": null,
    "OnPremisesExtensionAttributes": {
      "ExtensionAttribute1": null,
      "ExtensionAttribute10": null,
      "ExtensionAttribute11": null,
      "ExtensionAttribute12": null,
      "ExtensionAttribute13": null,
      "ExtensionAttribute14": null,
      "ExtensionAttribute15": null,
      "ExtensionAttribute2": null,
      "ExtensionAttribute3": null,
      "ExtensionAttribute4": null,
      "ExtensionAttribute5": null,
      "ExtensionAttribute6": null,
      "ExtensionAttribute7": null,
      "ExtensionAttribute8": null,
      "ExtensionAttribute9": null
    },
    "OnPremisesImmutableId": null,
    "OnPremisesLastSyncDateTime": null,
    "OnPremisesProvisioningErrors": [],
    "OnPremisesSamAccountName": null,
    "OnPremisesSecurityIdentifier": null,
    "OnPremisesSipInfo": {
      "IsSipEnabled": false,
      "SipDeploymentLocation": null,
      "SipPrimaryAddress": null
    },
    "OnPremisesSyncEnabled": null,
    "OnPremisesUserPrincipalName": null,
    "Onenote": {
      "Id": null,
      "Notebooks": null,
      "Operations": null,
      "Pages": null,
      "Resources": null,
      "SectionGroups": null,
      "Sections": null
    },
    "OnlineMeetings": null,
    "OtherMails": [],
    "Outlook": {
      "Id": null,
      "MasterCategories": null,
      "TaskFolders": null,
      "TaskGroups": null,
      "Tasks": null
    },
    "OwnedDevices": null,
    "OwnedObjects": null,
    "PasswordPolicies": null,
    "PasswordProfile": {
      "ForceChangePasswordNextSignIn": null,
      "ForceChangePasswordNextSignInWithMfa": null,
      "Password": null
    },
    "PastProjects": null,
    "PendingAccessReviewInstances": null,
    "People": null,
    "PermissionGrants": null,
    "Photo": {
      "Height": null,
      "Id": null,
      "Width": null
    },
    "Photos": null,
    "Planner": {
      "All": null,
      "FavoritePlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerFavoritePlanReferenceCollection",
      "FavoritePlans": null,
      "Id": null,
      "MyDayTasks": null,
      "Plans": null,
      "RecentPlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerRecentPlanReferenceCollection",
      "RecentPlans": null,
      "RosterPlans": null,
      "Tasks": null
    },
    "PostalCode": null,
    "PreferredDataLocation": null,
    "PreferredLanguage": null,
    "PreferredName": null,
    "Presence": {
      "Activity": null,
      "Availability": null,
      "Id": null,
      "OutOfOfficeSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphOutOfOfficeSettings",
      "StatusMessage": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPresenceStatusMessage"
    },
    "Print": {
      "RecentPrinterShares": null
    },
    "Profile": {
      "Account": null,
      "Addresses": null,
      "Anniversaries": null,
      "Awards": null,
      "Certifications": null,
      "EducationalActivities": null,
      "Emails": null,
      "Id": null,
      "Interests": null,
      "Languages": null,
      "Names": null,
      "Notes": null,
      "Patents": null,
      "Phones": null,
      "Positions": null,
      "Projects": null,
      "Publications": null,
      "Skills": null,
      "WebAccounts": null,
      "Websites": null
    },
    "ProvisionedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan"
    ],
    "ProxyAddresses": [
      "SMTP:ryan.baker_Priv@sdablueprinthybriddev.onmicrosoft.com"
    ],
    "RefreshTokensValidFromDateTime": "2024-01-17T01:36:52Z",
    "RegisteredDevices": null,
    "Responsibilities": null,
    "Schools": null,
    "ScopedRoleMemberOf": null,
    "Security": {
      "Id": null,
      "InformationProtection": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSecurityInformationProtection"
    },
    "SecurityIdentifier": "S-1-12-1-1369348118-1113872637-3357961625-696409885",
    "ServiceProvisioningErrors": [],
    "Settings": {
      "ContactMergeSuggestions": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphContactMergeSuggestions",
      "ContributionToContentDiscoveryAsOrganizationDisabled": null,
      "ContributionToContentDiscoveryDisabled": null,
      "Id": null,
      "ItemInsights": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUserInsightsSettings",
      "RegionalAndLanguageSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphRegionalAndLanguageSettings",
      "ShiftPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphShiftPreferences"
    },
    "ShowInAddressList": null,
    "SignInActivity": {
      "LastNonInteractiveSignInDateTime": null,
      "LastNonInteractiveSignInRequestId": null,
      "LastSignInDateTime": null,
      "LastSignInRequestId": null,
      "LastSuccessfulSignInDateTime": null,
      "LastSuccessfulSignInRequestId": null
    },
    "SignInSessionsValidFromDateTime": "2024-01-17T01:36:52Z",
    "Skills": null,
    "Sponsors": null,
    "State": null,
    "StreetAddress": null,
    "Surname": null,
    "Teamwork": {
      "AssociatedTeams": null,
      "Id": null,
      "InstalledApps": null,
      "Locale": null,
      "Region": null
    },
    "Todo": {
      "Id": null,
      "Lists": null
    },
    "TransitiveMemberOf": null,
    "TransitiveReports": null,
    "UsageLocation": "AU",
    "UsageRights": null,
    "UserPrincipalName": "ryan.baker_Priv@sdablueprinthybriddev.onmicrosoft.com",
    "UserType": "Member",
    "VirtualEvents": {
      "Id": null,
      "Webinars": null
    },
    "WindowsInformationProtectionDeviceRegistrations": null,
    "AdditionalProperties": {}
  },
  {
    "AboutMe": null,
    "AccountEnabled": true,
    "Activities": null,
    "AgeGroup": null,
    "AgreementAcceptances": null,
    "Analytics": {
      "ActivityStatistics": null,
      "Id": null,
      "Settings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSettings"
    },
    "AppConsentRequestsForApproval": null,
    "AppRoleAssignedResources": null,
    "AppRoleAssignments": null,
    "Approvals": null,
    "AssignedLicenses": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedLicense"
    ],
    "AssignedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAssignedPlan"
    ],
    "Authentication": {
      "EmailMethods": null,
      "Fido2Methods": null,
      "Id": null,
      "Methods": null,
      "MicrosoftAuthenticatorMethods": null,
      "Operations": null,
      "PasswordMethods": null,
      "PasswordlessMicrosoftAuthenticatorMethods": null,
      "PhoneMethods": null,
      "PlatformCredentialMethods": null,
      "SignInPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSignInPreferences",
      "SoftwareOathMethods": null,
      "TemporaryAccessPassMethods": null,
      "WindowsHelloForBusinessMethods": null
    },
    "AuthorizationInfo": {
      "CertificateUserIds": ""
    },
    "Birthday": null,
    "BusinessPhones": [],
    "Calendar": {
      "AllowedOnlineMeetingProviders": null,
      "CalendarGroupId": null,
      "CalendarPermissions": null,
      "CalendarView": null,
      "CanEdit": null,
      "CanShare": null,
      "CanViewPrivateItems": null,
      "ChangeKey": null,
      "Color": null,
      "DefaultOnlineMeetingProvider": null,
      "Events": null,
      "HexColor": null,
      "Id": null,
      "IsDefaultCalendar": null,
      "IsRemovable": null,
      "IsShared": null,
      "IsSharedWithMe": null,
      "IsTallyingResponses": null,
      "MultiValueExtendedProperties": null,
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphEmailAddress",
      "SingleValueExtendedProperties": null
    },
    "CalendarGroups": null,
    "CalendarView": null,
    "Calendars": null,
    "Chats": null,
    "City": null,
    "CloudPCs": null,
    "CloudRealtimeCommunicationInfo": {
      "IsSipEnabled": true
    },
    "CompanyName": null,
    "ConsentProvidedForMinor": null,
    "ContactFolders": null,
    "Contacts": null,
    "Country": null,
    "CreatedDateTime": "2023-10-29T23:35:47Z",
    "CreatedObjects": null,
    "CreationType": null,
    "CustomSecurityAttributes": {},
    "DeletedDateTime": null,
    "Department": null,
    "DeviceEnrollmentConfigurations": null,
    "DeviceEnrollmentLimit": null,
    "DeviceKeys": [],
    "DeviceManagementTroubleshootingEvents": null,
    "Devices": null,
    "DirectReports": null,
    "DisplayName": "Test user1",
    "Drive": {
      "Activities": null,
      "Bundles": null,
      "CreatedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "CreatedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "CreatedDateTime": null,
      "Description": null,
      "DriveType": null,
      "ETag": null,
      "Following": null,
      "Id": null,
      "Items": null,
      "LastModifiedBy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "LastModifiedByUser": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUser",
      "LastModifiedDateTime": null,
      "List": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphList",
      "Name": null,
      "Owner": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphIdentitySet",
      "ParentReference": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphItemReference",
      "Quota": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphQuota",
      "Root": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphDriveItem",
      "SharePointIds": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSharepointIds",
      "Special": null,
      "System": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSystemFacet",
      "WebUrl": null
    },
    "Drives": null,
    "EmployeeExperience": {
      "Id": null,
      "LearningCourseActivities": null
    },
    "EmployeeHireDate": null,
    "EmployeeId": null,
    "EmployeeLeaveDateTime": null,
    "EmployeeOrgData": {
      "CostCenter": null,
      "Division": null
    },
    "EmployeeType": null,
    "Events": null,
    "Extensions": null,
    "ExternalUserState": null,
    "ExternalUserStateChangeDateTime": null,
    "FaxNumber": null,
    "FollowedSites": null,
    "GivenName": "Test",
    "HireDate": null,
    "Id": "511f08e2-8b0f-42bb-bbd8-6ad67e272bd5",
    "Identities": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphObjectIdentity"
    ],
    "ImAddresses": [
      "testuser1@sdablueprinthybriddev.onmicrosoft.com"
    ],
    "InferenceClassification": {
      "Id": null,
      "Overrides": null
    },
    "InfoCatalogs": [],
    "InformationProtection": {
      "Bitlocker": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphBitlocker",
      "DataLossPreventionPolicies": null,
      "Id": null,
      "Policy": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphInformationProtectionPolicy",
      "SensitivityLabels": null,
      "SensitivityPolicySettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSensitivityPolicySettings",
      "ThreatAssessmentRequests": null
    },
    "Insights": {
      "Id": null,
      "Shared": null,
      "Trending": null,
      "Used": null
    },
    "Interests": null,
    "IsLicenseReconciliationNeeded": false,
    "IsManagementRestricted": null,
    "IsResourceAccount": null,
    "JobTitle": "Finance Operator",
    "JoinedGroups": null,
    "JoinedTeams": null,
    "LastPasswordChangeDateTime": null,
    "LegalAgeGroupClassification": null,
    "LicenseAssignmentStates": null,
    "LicenseDetails": null,
    "Mail": "testuser1@sdablueprinthybriddev.onmicrosoft.com",
    "MailFolders": null,
    "MailNickname": "testuser1",
    "MailboxSettings": {
      "ArchiveFolder": null,
      "AutomaticRepliesSetting": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphAutomaticRepliesSetting",
      "DateFormat": null,
      "DelegateMeetingMessageDeliveryOptions": null,
      "Language": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphLocaleInfo",
      "TimeFormat": null,
      "TimeZone": null,
      "UserPurpose": null,
      "UserPurposeV2": null,
      "WorkingHours": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphWorkingHours"
    },
    "ManagedAppRegistrations": null,
    "ManagedDevices": null,
    "Manager": {
      "DeletedDateTime": null,
      "Id": null
    },
    "MemberOf": null,
    "Messages": null,
    "MobileAppIntentAndStates": null,
    "MobileAppTroubleshootingEvents": null,
    "MobilePhone": null,
    "MySite": null,
    "Notifications": null,
    "Oauth2PermissionGrants": null,
    "OfficeLocation": null,
    "OnPremisesDistinguishedName": null,
    "OnPremisesDomainName": null,
    "OnPremisesExtensionAttributes": {
      "ExtensionAttribute1": null,
      "ExtensionAttribute10": null,
      "ExtensionAttribute11": null,
      "ExtensionAttribute12": null,
      "ExtensionAttribute13": null,
      "ExtensionAttribute14": null,
      "ExtensionAttribute15": null,
      "ExtensionAttribute2": null,
      "ExtensionAttribute3": null,
      "ExtensionAttribute4": null,
      "ExtensionAttribute5": null,
      "ExtensionAttribute6": null,
      "ExtensionAttribute7": null,
      "ExtensionAttribute8": null,
      "ExtensionAttribute9": null
    },
    "OnPremisesImmutableId": null,
    "OnPremisesLastSyncDateTime": null,
    "OnPremisesProvisioningErrors": [],
    "OnPremisesSamAccountName": null,
    "OnPremisesSecurityIdentifier": null,
    "OnPremisesSipInfo": {
      "IsSipEnabled": false,
      "SipDeploymentLocation": null,
      "SipPrimaryAddress": null
    },
    "OnPremisesSyncEnabled": null,
    "OnPremisesUserPrincipalName": null,
    "Onenote": {
      "Id": null,
      "Notebooks": null,
      "Operations": null,
      "Pages": null,
      "Resources": null,
      "SectionGroups": null,
      "Sections": null
    },
    "OnlineMeetings": null,
    "OtherMails": [],
    "Outlook": {
      "Id": null,
      "MasterCategories": null,
      "TaskFolders": null,
      "TaskGroups": null,
      "Tasks": null
    },
    "OwnedDevices": null,
    "OwnedObjects": null,
    "PasswordPolicies": "None",
    "PasswordProfile": {
      "ForceChangePasswordNextSignIn": null,
      "ForceChangePasswordNextSignInWithMfa": null,
      "Password": null
    },
    "PastProjects": null,
    "PendingAccessReviewInstances": null,
    "People": null,
    "PermissionGrants": null,
    "Photo": {
      "Height": null,
      "Id": null,
      "Width": null
    },
    "Photos": null,
    "Planner": {
      "All": null,
      "FavoritePlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerFavoritePlanReferenceCollection",
      "FavoritePlans": null,
      "Id": null,
      "MyDayTasks": null,
      "Plans": null,
      "RecentPlanReferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPlannerRecentPlanReferenceCollection",
      "RecentPlans": null,
      "RosterPlans": null,
      "Tasks": null
    },
    "PostalCode": null,
    "PreferredDataLocation": null,
    "PreferredLanguage": null,
    "PreferredName": null,
    "Presence": {
      "Activity": null,
      "Availability": null,
      "Id": null,
      "OutOfOfficeSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphOutOfOfficeSettings",
      "StatusMessage": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphPresenceStatusMessage"
    },
    "Print": {
      "RecentPrinterShares": null
    },
    "Profile": {
      "Account": null,
      "Addresses": null,
      "Anniversaries": null,
      "Awards": null,
      "Certifications": null,
      "EducationalActivities": null,
      "Emails": null,
      "Id": null,
      "Interests": null,
      "Languages": null,
      "Names": null,
      "Notes": null,
      "Patents": null,
      "Phones": null,
      "Positions": null,
      "Projects": null,
      "Publications": null,
      "Skills": null,
      "WebAccounts": null,
      "Websites": null
    },
    "ProvisionedPlans": [
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan",
      "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphProvisionedPlan"
    ],
    "ProxyAddresses": [
      "SMTP:testuser1@sdablueprinthybriddev.onmicrosoft.com"
    ],
    "RefreshTokensValidFromDateTime": "2023-11-07T05:59:34Z",
    "RegisteredDevices": null,
    "Responsibilities": null,
    "Schools": null,
    "ScopedRoleMemberOf": null,
    "Security": {
      "Id": null,
      "InformationProtection": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphSecurityInformationProtection"
    },
    "SecurityIdentifier": "S-1-12-1-1360988386-1119587087-3597326523-3576375166",
    "ServiceProvisioningErrors": [],
    "Settings": {
      "ContactMergeSuggestions": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphContactMergeSuggestions",
      "ContributionToContentDiscoveryAsOrganizationDisabled": null,
      "ContributionToContentDiscoveryDisabled": null,
      "Id": null,
      "ItemInsights": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphUserInsightsSettings",
      "RegionalAndLanguageSettings": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphRegionalAndLanguageSettings",
      "ShiftPreferences": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphShiftPreferences"
    },
    "ShowInAddressList": null,
    "SignInActivity": {
      "LastNonInteractiveSignInDateTime": null,
      "LastNonInteractiveSignInRequestId": null,
      "LastSignInDateTime": null,
      "LastSignInRequestId": null,
      "LastSuccessfulSignInDateTime": null,
      "LastSuccessfulSignInRequestId": null
    },
    "SignInSessionsValidFromDateTime": "2023-11-07T05:59:34Z",
    "Skills": null,
    "Sponsors": null,
    "State": null,
    "StreetAddress": null,
    "Surname": "user1",
    "Teamwork": {
      "AssociatedTeams": null,
      "Id": null,
      "InstalledApps": null,
      "Locale": null,
      "Region": null
    },
    "Todo": {
      "Id": null,
      "Lists": null
    },
    "TransitiveMemberOf": null,
    "TransitiveReports": null,
    "UsageLocation": "AU",
    "UsageRights": null,
    "UserPrincipalName": "testuser1@sdablueprinthybriddev.onmicrosoft.com",
    "UserType": "Member",
    "VirtualEvents": {
      "Id": null,
      "Webinars": null
    },
    "WindowsInformationProtectionDeviceRegistrations": null,
    "AdditionalProperties": {}
  }
],
    "authorisation_policy" : [
  {
    "AllowEmailVerifiedUsersToJoinOrganization": true,
    "AllowInvitesFrom": "none",
    "AllowUserConsentForRiskyApps": null,
    "AllowedToSignUpEmailBasedSubscriptions": true,
    "AllowedToUseSspr": true,
    "BlockMsolPowerShell": false,
    "DefaultUserRoleOverrides": null,
    "DefaultUserRolePermissions": {
      "AllowedToCreateApps": false,
      "AllowedToCreateSecurityGroups": false,
      "AllowedToCreateTenants": false,
      "AllowedToReadBitlockerKeysForOwnedDevice": true,
      "AllowedToReadOtherUsers": true
    },
    "DeletedDateTime": null,
    "Description": "Used to manage authorization related settings across the company.",
    "DisplayName": "Authorization Policy",
    "EnabledPreviewFeatures": [],
    "GuestUserRoleId": "2af84b1e-32c8-42b7-82bc-daa82404023b",
    "Id": "authorizationPolicy",
    "PermissionGrantPolicyIdsAssignedToDefaultUserRole": [
      "ManagePermissionGrantsForOwnedResource.microsoft-dynamically-managed-permissions-for-team",
      "ManagePermissionGrantsForOwnedResource.microsoft-dynamically-managed-permissions-for-chat"
    ]
  }
],
    "cross_tenant_access_policy" : [
  {
    "AutomaticUserConsentSettings": {
      "InboundAllowed": false,
      "OutboundAllowed": false
    },
    "B2BCollaborationInbound": {
      "Applications": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphCrossTenantAccessPolicyTargetConfiguration",
      "UsersAndGroups": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphCrossTenantAccessPolicyTargetConfiguration"
    },
    "B2BCollaborationOutbound": {
      "Applications": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphCrossTenantAccessPolicyTargetConfiguration",
      "UsersAndGroups": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphCrossTenantAccessPolicyTargetConfiguration"
    },
    "B2BDirectConnectInbound": {
      "Applications": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphCrossTenantAccessPolicyTargetConfiguration",
      "UsersAndGroups": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphCrossTenantAccessPolicyTargetConfiguration"
    },
    "B2BDirectConnectOutbound": {
      "Applications": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphCrossTenantAccessPolicyTargetConfiguration",
      "UsersAndGroups": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphCrossTenantAccessPolicyTargetConfiguration"
    },
    "Id": "f250f7fc-c869-46c2-b786-10dcf9a16f3a",
    "InboundTrust": {
      "IsCompliantDeviceAccepted": false,
      "IsHybridAzureAdJoinedDeviceAccepted": false,
      "IsMfaAccepted": false
    },
    "InvitationRedemptionIdentityProviderConfiguration": {
      "FallbackIdentityProvider": "defaultConfiguredIdp",
      "PrimaryIdentityProviderPrecedenceOrder": "azureActiveDirectory externalFederation socialIdentityProviders"
    },
    "IsServiceDefault": true,
    "TenantRestrictions": {
      "Applications": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphCrossTenantAccessPolicyTargetConfiguration",
      "Devices": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphDevicesFilter",
      "UsersAndGroups": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphCrossTenantAccessPolicyTargetConfiguration"
    }
  }
],
    "conditional_access_policy_admin_sign_in_frequency" : {
  "Conditions": {
    "Applications": {
      "ApplicationFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeApplications": "",
      "IncludeApplications": "All",
      "IncludeAuthenticationContextClassReferences": "",
      "IncludeUserActions": ""
    },
    "ClientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients",
      "other"
    ],
    "ClientApplications": {
      "ExcludeServicePrincipals": null,
      "IncludeServicePrincipals": null,
      "ServicePrincipalFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter"
    },
    "DeviceStates": {
      "ExcludeStates": null,
      "IncludeStates": null
    },
    "Devices": {
      "DeviceFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeDeviceStates": null,
      "ExcludeDevices": null,
      "IncludeDeviceStates": null,
      "IncludeDevices": null
    },
    "Locations": {
      "ExcludeLocations": null,
      "IncludeLocations": null
    },
    "Platforms": {
      "ExcludePlatforms": null,
      "IncludePlatforms": null
    },
    "ServicePrincipalRiskLevels": null,
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": "a2b89a91-d113-4d94-9d17-08875130ecc1",
      "ExcludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "ExcludeRoles": "",
      "ExcludeUsers": "",
      "IncludeGroups": "",
      "IncludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "IncludeRoles": "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3 cf1c38e5-3621-4004-a7cb-879624dced7c 9c6df0f2-1e7c-4dc3-b195-66dfbd24aa8f c430b396-e693-46cc-96f3-db01bf8bb62a 8424c6f0-a189-499e-bbd0-26c1753c96d4 ffd52fa5-98dc-465c-991d-fc073eb59f8f 58a13ea3-c632-46ae-9ee0-9c0d43cd7f3d 4a5d8f65-41da-4de4-8968-e035b65339cf 507f53e4-4e52-4077-abd3-d2e1558b6ea2 f28a1f50-f6e7-4571-818b-6a12f2af6b6c 810a2642-a034-447f-a5e8-41beaa378541 32696413-001a-46ae-978c-ce0f6b3620d2 11451d60-acb2-45eb-a7d6-43d0f0125c13 92b086b3-e367-4ef2-b869-1de128fb986e e300d9e7-4a2b-4295-9eff-f1c78b36cc98 27460883-1df1-4691-b032-3b79643e5e63 fe930be7-5e62-47db-91af-98c3a49a38b1 75934031-6c7e-415a-99d7-48dbd49e875e 112ca1a2-15ad-4102-995e-45b0bc479a6a 3d762c5a-1b6c-493f-843e-55a3b42923d4 fcf91098-03e3-41a9-b5ba-6f0ec8188a12 f70938a0-fc10-4177-9e90-2178f8765737 baf37b3a-610e-45da-9e62-d9d1e5e8914b 69091246-20e8-4a56-aa4d-066075b2a7a8 75941009-915a-4869-abe7-691bff18279e f023fd81-a637-4b56-95fd-791ac0226033 5d6b6bb7-de71-4623-b4af-96380a352509 194ae4cb-b126-40b2-bd5b-6091b380977d 5f2222b1-57c3-48ba-8ad5-d4759f1fde6f 8835291a-918c-4fd7-a9ce-faa49f0cf7d9 0964bb5e-9bdb-4d7b-ac29-58e794862a40 e8611ab8-c189-46e8-94e1-60213ab1f814 7be44c8a-adaf-4e2a-84d6-ab2649e08a13 e8cef6f1-e4bd-4ea8-bc07-4b8d950f4477 644ef478-e28f-4e28-b9dc-3fdde9aa0b1f 11648597-926c-4cf3-9c36-bcebb0ba8dcc a9ea8996-122f-4c74-9520-8edcd192826c af78dc32-cf4d-46f9-ba4e-4428526346b5 966707d0-3269-4727-9be2-8c3a10f19b9d 2b745bdf-0803-4d80-aa65-822c4493daac d37c8bed-0711-4417-ba38-b4abe66ce4c2 281fe777-fb20-4fbb-b7a3-ccebce5b0d96 1501b917-7653-4ff9-a4b5-203eaf33784f 790c1fb9-7f7d-4f88-86a1-ef1f95c05c1b ac16e43d-7b2d-40e0-ac05-243ff356ab5b 59d46f88-662b-457b-bceb-5c3809e5908f 4d6ac14f-3453-41d0-bef9-a3e0c569773a 744ec460-397e-42ad-a462-8b3f9747a02c b5a8dcf3-09d5-43a9-a639-8e29ef291470 74ef975b-6605-40af-a5d2-b9539d836353 3a2c62db-5318-420d-8d74-23affee5d9d5 31e939ad-9672-4796-9c2e-873181342d2d 25df335f-86eb-4119-b717-0ff02de207e9 eb1f4a8d-243a-41f0-9fbd-c7cdf6c5ef7c 45d8d3c5-c802-45c6-b32a-1d70b5e1e86e 8ac3fc64-6eca-42ea-9e69-59f4c7b60eb2 729827e3-9c14-49f7-bb1b-9608f156bbb8 95e79109-95c0-4d8e-aee3-d01accf2d47b fdd7a751-b60b-444a-984c-02652fe8fa1c f2ef992c-3afb-46b9-b7cf-a126ee74c451 62e90394-69f5-4237-9190-012177145e10 be2f45a1-457d-42af-a067-6ec1fa63bc45 0f971eea-41eb-4569-a71e-57bb8a3eff1e 6e591065-9bad-43ed-90f3-e9424366d2f0 31392ffb-586c-42d1-9346-e59415a2cc4e 29232cdf-9323-42fd-ade2-1d097af3e4de 3f1acade-1e04-4fbc-9b69-f0302cd84aef 44367163-eba1-44c3-98af-f5787879f96a 8329153b-31d0-4727-b945-745eb3bc5f31 9360feb5-f418-4baa-8175-e2a00bac4301 d29b2b05-8046-44ba-8758-1e26182fcf32 88d8e3e3-8f55-4a1e-953a-9b9898b8876b 38a96431-2bdf-4b4c-8b6e-5d3d8abac1a4 5c4f9dcd-47dc-4cf7-8c9a-9e4207cbfc91 b1be1c3e-b65d-4f19-8427-f6fa0d97feb9 e6d1a23a-da11-4be4-9570-befc86d067a7 17315797-102d-40b4-93e0-432062caca18 7698a772-787b-4ac8-901f-60d6b08affd2 158c047a-c907-4556-b7ef-446551a6b5f7 892c5842-a9a6-463a-8041-72aa08ca3cf6 b0f54661-2d74-4c50-afa3-1ec803f12efe 3edaf663-341e-4475-9f94-5c398ef6c070 7495fdc4-34c4-4d15-a289-98788ce399fd aaf43236-0c0d-4d5f-883a-6955382ac081 e3973bdf-4987-49ae-837a-ba8e231c7286 9f06204d-73c1-4d4c-880a-6edb90606fd8 0526716b-113d-4c15-b2c8-68e3c22b9f80 c4e39bd9-1100-46d3-8c65-fb160da0071f 25a516ed-2fa0-40ea-a2d0-12923a21473a 1d336d2c-4ae8-42ef-9711-b3604ce3fc2c",
      "IncludeUsers": ""
    }
  },
  "CreatedDateTime": "2023-07-26T03:57:34.8815849Z",
  "Description": null,
  "DisplayName": "SESSION - Admin Sign-in Frequency",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": null,
      "CombinationConfigurations": null,
      "CreatedDateTime": null,
      "Description": null,
      "DisplayName": null,
      "Id": null,
      "ModifiedDateTime": null,
      "PolicyType": null,
      "RequirementsSatisfied": null
    },
    "BuiltInControls": [
      "mfa"
    ],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "Id": "f14f88d7-2665-4ce6-b89b-125b11588383",
  "ModifiedDateTime": "2024-02-07T00:33:22.463122Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "ContinuousAccessEvaluation": {
      "Mode": null
    },
    "DisableResilienceDefaults": null,
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": "primaryAndSecondaryAuthentication",
      "FrequencyInterval": "timeBased",
      "IsEnabled": true,
      "Type": "hours",
      "Value": 4
    }
  },
  "State": "enabled",
  "AdditionalProperties": {}
},
    "conditional_access_policy_countries_not_allowed" : {
  "Conditions": {
    "Applications": {
      "ApplicationFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeApplications": "",
      "IncludeApplications": "All",
      "IncludeAuthenticationContextClassReferences": "",
      "IncludeUserActions": ""
    },
    "ClientAppTypes": [
      "all"
    ],
    "ClientApplications": {
      "ExcludeServicePrincipals": null,
      "IncludeServicePrincipals": null,
      "ServicePrincipalFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter"
    },
    "DeviceStates": {
      "ExcludeStates": null,
      "IncludeStates": null
    },
    "Devices": {
      "DeviceFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeDeviceStates": null,
      "ExcludeDevices": null,
      "IncludeDeviceStates": null,
      "IncludeDevices": null
    },
    "Locations": {
      "ExcludeLocations": "1ea33f82-a850-412b-937b-e3cdea4b9dd7",
      "IncludeLocations": "All"
    },
    "Platforms": {
      "ExcludePlatforms": null,
      "IncludePlatforms": null
    },
    "ServicePrincipalRiskLevels": null,
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": "a2b89a91-d113-4d94-9d17-08875130ecc1",
      "ExcludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "ExcludeRoles": "",
      "ExcludeUsers": "",
      "IncludeGroups": "",
      "IncludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "IncludeRoles": "",
      "IncludeUsers": "All"
    }
  },
  "CreatedDateTime": "2023-07-26T03:29:57.8176341Z",
  "Description": null,
  "DisplayName": "BLOCK - Countries Not Allowed",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": null,
      "CombinationConfigurations": null,
      "CreatedDateTime": null,
      "Description": null,
      "DisplayName": null,
      "Id": null,
      "ModifiedDateTime": null,
      "PolicyType": null,
      "RequirementsSatisfied": null
    },
    "BuiltInControls": [
      "block"
    ],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "Id": "1e07844e-825d-4e30-824a-3cb0f34cdd2a",
  "ModifiedDateTime": null,
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "ContinuousAccessEvaluation": {
      "Mode": null
    },
    "DisableResilienceDefaults": null,
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": null,
      "FrequencyInterval": null,
      "IsEnabled": null,
      "Type": null,
      "Value": null
    }
  },
  "State": "enabled",
  "AdditionalProperties": {}
},
    "conditional_access_policy_guest_access_block" : {
  "Conditions": {
    "Applications": {
      "ApplicationFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeApplications": "Office365",
      "IncludeApplications": "All",
      "IncludeAuthenticationContextClassReferences": "",
      "IncludeUserActions": ""
    },
    "ClientAppTypes": [
      "exchangeActiveSync",
      "browser",
      "mobileAppsAndDesktopClients",
      "other"
    ],
    "ClientApplications": {
      "ExcludeServicePrincipals": null,
      "IncludeServicePrincipals": null,
      "ServicePrincipalFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter"
    },
    "DeviceStates": {
      "ExcludeStates": null,
      "IncludeStates": null
    },
    "Devices": {
      "DeviceFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeDeviceStates": null,
      "ExcludeDevices": null,
      "IncludeDeviceStates": null,
      "IncludeDevices": null
    },
    "Locations": {
      "ExcludeLocations": null,
      "IncludeLocations": null
    },
    "Platforms": {
      "ExcludePlatforms": null,
      "IncludePlatforms": null
    },
    "ServicePrincipalRiskLevels": null,
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": "",
      "ExcludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "ExcludeRoles": "",
      "ExcludeUsers": "",
      "IncludeGroups": "",
      "IncludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "IncludeRoles": "",
      "IncludeUsers": ""
    }
  },
  "CreatedDateTime": "2023-07-26T03:37:36.072997Z",
  "Description": null,
  "DisplayName": "BLOCK - Guest Access",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": null,
      "CombinationConfigurations": null,
      "CreatedDateTime": null,
      "Description": null,
      "DisplayName": null,
      "Id": null,
      "ModifiedDateTime": null,
      "PolicyType": null,
      "RequirementsSatisfied": null
    },
    "BuiltInControls": [
      "block"
    ],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "Id": "efd4b3c6-e78d-49ad-ac6a-ca0436576317",
  "ModifiedDateTime": "2024-01-29T23:21:46.7695452Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "ContinuousAccessEvaluation": {
      "Mode": null
    },
    "DisableResilienceDefaults": null,
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": null,
      "FrequencyInterval": null,
      "IsEnabled": null,
      "Type": null,
      "Value": null
    }
  },
  "State": "enabled",
  "AdditionalProperties": {}
},
    "conditional_access_policy_guest_access_grant" : {
  "Conditions": {
    "Applications": {
      "ApplicationFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeApplications": "",
      "IncludeApplications": "Office365",
      "IncludeAuthenticationContextClassReferences": "",
      "IncludeUserActions": ""
    },
    "ClientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "ClientApplications": {
      "ExcludeServicePrincipals": null,
      "IncludeServicePrincipals": null,
      "ServicePrincipalFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter"
    },
    "DeviceStates": {
      "ExcludeStates": null,
      "IncludeStates": null
    },
    "Devices": {
      "DeviceFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeDeviceStates": null,
      "ExcludeDevices": null,
      "IncludeDeviceStates": null,
      "IncludeDevices": null
    },
    "Locations": {
      "ExcludeLocations": null,
      "IncludeLocations": null
    },
    "Platforms": {
      "ExcludePlatforms": "",
      "IncludePlatforms": "windows"
    },
    "ServicePrincipalRiskLevels": null,
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": "",
      "ExcludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "ExcludeRoles": "",
      "ExcludeUsers": "",
      "IncludeGroups": "",
      "IncludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "IncludeRoles": "",
      "IncludeUsers": ""
    }
  },
  "CreatedDateTime": "2023-07-26T03:43:51.0193251Z",
  "Description": null,
  "DisplayName": "GRANT - Guest Access",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": null,
      "CombinationConfigurations": null,
      "CreatedDateTime": null,
      "Description": null,
      "DisplayName": null,
      "Id": null,
      "ModifiedDateTime": null,
      "PolicyType": null,
      "RequirementsSatisfied": null
    },
    "BuiltInControls": [
      "mfa"
    ],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "Id": "d015040f-99fd-4e7c-abc1-35f5e5a9c728",
  "ModifiedDateTime": "2024-01-29T23:22:00.1732638Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "ContinuousAccessEvaluation": {
      "Mode": null
    },
    "DisableResilienceDefaults": null,
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": null,
      "FrequencyInterval": null,
      "IsEnabled": null,
      "Type": null,
      "Value": null
    }
  },
  "State": "disabled",
  "AdditionalProperties": {}
},
    "conditional_access_policy_high_risk_sign_ins_grant" : {
  "Conditions": {
    "Applications": {
      "ApplicationFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeApplications": "",
      "IncludeApplications": "All",
      "IncludeAuthenticationContextClassReferences": "",
      "IncludeUserActions": ""
    },
    "ClientAppTypes": [
      "exchangeActiveSync",
      "browser",
      "mobileAppsAndDesktopClients",
      "other"
    ],
    "ClientApplications": {
      "ExcludeServicePrincipals": null,
      "IncludeServicePrincipals": null,
      "ServicePrincipalFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter"
    },
    "DeviceStates": {
      "ExcludeStates": null,
      "IncludeStates": null
    },
    "Devices": {
      "DeviceFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeDeviceStates": null,
      "ExcludeDevices": null,
      "IncludeDeviceStates": null,
      "IncludeDevices": null
    },
    "Locations": {
      "ExcludeLocations": null,
      "IncludeLocations": null
    },
    "Platforms": {
      "ExcludePlatforms": null,
      "IncludePlatforms": null
    },
    "ServicePrincipalRiskLevels": null,
    "SignInRiskLevels": [
      "high"
    ],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": "a2b89a91-d113-4d94-9d17-08875130ecc1",
      "ExcludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "ExcludeRoles": "",
      "ExcludeUsers": "",
      "IncludeGroups": "",
      "IncludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "IncludeRoles": "",
      "IncludeUsers": "All"
    }
  },
  "CreatedDateTime": "2023-07-26T03:39:47.8099676Z",
  "Description": null,
  "DisplayName": "BLOCK - High Risk Sign-Ins",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": null,
      "CombinationConfigurations": null,
      "CreatedDateTime": null,
      "Description": null,
      "DisplayName": null,
      "Id": null,
      "ModifiedDateTime": null,
      "PolicyType": null,
      "RequirementsSatisfied": null
    },
    "BuiltInControls": [
      "block"
    ],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "Id": "4f73b5d4-020e-4631-af22-d6ddd914d1bc",
  "ModifiedDateTime": "2024-02-07T00:09:08.352946Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "ContinuousAccessEvaluation": {
      "Mode": null
    },
    "DisableResilienceDefaults": null,
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": null,
      "FrequencyInterval": null,
      "IsEnabled": null,
      "Type": null,
      "Value": null
    }
  },
  "State": "enabled",
  "AdditionalProperties": {}
},
    "conditional_access_policy_legacy_auth_block" : {
  "Conditions": {
    "Applications": {
      "ApplicationFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeApplications": "",
      "IncludeApplications": "All",
      "IncludeAuthenticationContextClassReferences": "",
      "IncludeUserActions": ""
    },
    "ClientAppTypes": [
      "exchangeActiveSync",
      "other"
    ],
    "ClientApplications": {
      "ExcludeServicePrincipals": null,
      "IncludeServicePrincipals": null,
      "ServicePrincipalFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter"
    },
    "DeviceStates": {
      "ExcludeStates": null,
      "IncludeStates": null
    },
    "Devices": {
      "DeviceFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeDeviceStates": null,
      "ExcludeDevices": null,
      "IncludeDeviceStates": null,
      "IncludeDevices": null
    },
    "Locations": {
      "ExcludeLocations": null,
      "IncludeLocations": null
    },
    "Platforms": {
      "ExcludePlatforms": null,
      "IncludePlatforms": null
    },
    "ServicePrincipalRiskLevels": null,
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": "a2b89a91-d113-4d94-9d17-08875130ecc1",
      "ExcludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "ExcludeRoles": "",
      "ExcludeUsers": "",
      "IncludeGroups": "",
      "IncludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "IncludeRoles": "",
      "IncludeUsers": "All"
    }
  },
  "CreatedDateTime": "2023-07-26T03:40:40.1853735Z",
  "Description": null,
  "DisplayName": "BLOCK - Legacy Authentication",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": null,
      "CombinationConfigurations": null,
      "CreatedDateTime": null,
      "Description": null,
      "DisplayName": null,
      "Id": null,
      "ModifiedDateTime": null,
      "PolicyType": null,
      "RequirementsSatisfied": null
    },
    "BuiltInControls": [
      "block"
    ],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "Id": "03cd82f7-61dc-4b79-ba6f-825733e38286",
  "ModifiedDateTime": "2024-02-07T00:10:08.2850214Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "ContinuousAccessEvaluation": {
      "Mode": null
    },
    "DisableResilienceDefaults": null,
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": null,
      "FrequencyInterval": null,
      "IsEnabled": null,
      "Type": null,
      "Value": null
    }
  },
  "State": "enabled",
  "AdditionalProperties": {}
},
    "conditional_access_policy_mfa_guest_b2b_access" : {
  "Conditions": {
    "Applications": {
      "ApplicationFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeApplications": "",
      "IncludeApplications": "None",
      "IncludeAuthenticationContextClassReferences": "",
      "IncludeUserActions": ""
    },
    "ClientAppTypes": [
      "all"
    ],
    "ClientApplications": {
      "ExcludeServicePrincipals": null,
      "IncludeServicePrincipals": null,
      "ServicePrincipalFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter"
    },
    "DeviceStates": {
      "ExcludeStates": null,
      "IncludeStates": null
    },
    "Devices": {
      "DeviceFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeDeviceStates": null,
      "ExcludeDevices": null,
      "IncludeDeviceStates": null,
      "IncludeDevices": null
    },
    "Locations": {
      "ExcludeLocations": null,
      "IncludeLocations": null
    },
    "Platforms": {
      "ExcludePlatforms": null,
      "IncludePlatforms": null
    },
    "ServicePrincipalRiskLevels": null,
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": "",
      "ExcludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "ExcludeRoles": "62e90394-69f5-4237-9190-012177145e10",
      "ExcludeUsers": "",
      "IncludeGroups": "",
      "IncludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "IncludeRoles": "",
      "IncludeUsers": ""
    }
  },
  "CreatedDateTime": "2023-12-11T00:22:52.4115467Z",
  "Description": null,
  "DisplayName": "MFA-Guest-Users-B2B",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": null,
      "CombinationConfigurations": null,
      "CreatedDateTime": null,
      "Description": null,
      "DisplayName": null,
      "Id": null,
      "ModifiedDateTime": null,
      "PolicyType": null,
      "RequirementsSatisfied": null
    },
    "BuiltInControls": [
      "mfa"
    ],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "Id": "91d98558-e2ce-4a20-bd95-c08f22fc6d22",
  "ModifiedDateTime": "2024-01-29T23:47:09.7838534Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "ContinuousAccessEvaluation": {
      "Mode": null
    },
    "DisableResilienceDefaults": null,
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": null,
      "FrequencyInterval": null,
      "IsEnabled": null,
      "Type": null,
      "Value": null
    }
  },
  "State": "disabled",
  "AdditionalProperties": {}
},
    "conditional_access_policy_session_sign_in_frequency" : {
  "Conditions": {
    "Applications": {
      "ApplicationFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeApplications": "",
      "IncludeApplications": "All",
      "IncludeAuthenticationContextClassReferences": "",
      "IncludeUserActions": ""
    },
    "ClientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients",
      "other"
    ],
    "ClientApplications": {
      "ExcludeServicePrincipals": null,
      "IncludeServicePrincipals": null,
      "ServicePrincipalFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter"
    },
    "DeviceStates": {
      "ExcludeStates": null,
      "IncludeStates": null
    },
    "Devices": {
      "DeviceFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeDeviceStates": null,
      "ExcludeDevices": null,
      "IncludeDeviceStates": null,
      "IncludeDevices": null
    },
    "Locations": {
      "ExcludeLocations": null,
      "IncludeLocations": null
    },
    "Platforms": {
      "ExcludePlatforms": null,
      "IncludePlatforms": null
    },
    "ServicePrincipalRiskLevels": null,
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": "a2b89a91-d113-4d94-9d17-08875130ecc1",
      "ExcludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "ExcludeRoles": "",
      "ExcludeUsers": "",
      "IncludeGroups": "",
      "IncludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "IncludeRoles": "",
      "IncludeUsers": "All"
    }
  },
  "CreatedDateTime": "2023-07-26T04:00:44.1118526Z",
  "Description": null,
  "DisplayName": "SESSION - User Sign-in Frequency",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": null,
      "CombinationConfigurations": null,
      "CreatedDateTime": null,
      "Description": null,
      "DisplayName": null,
      "Id": null,
      "ModifiedDateTime": null,
      "PolicyType": null,
      "RequirementsSatisfied": null
    },
    "BuiltInControls": [
      "mfa"
    ],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "Id": "07d16e09-b8f2-46e9-9b90-71d85ce589b3",
  "ModifiedDateTime": "2024-02-07T00:33:38.796689Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "ContinuousAccessEvaluation": {
      "Mode": null
    },
    "DisableResilienceDefaults": null,
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": "primaryAndSecondaryAuthentication",
      "FrequencyInterval": "timeBased",
      "IsEnabled": true,
      "Type": "hours",
      "Value": 12
    }
  },
  "State": "enabled",
  "AdditionalProperties": {}
},
    "conditional_access_policy_terms_of_use_grant" : {
  "Conditions": {
    "Applications": {
      "ApplicationFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeApplications": "",
      "IncludeApplications": "All",
      "IncludeAuthenticationContextClassReferences": "",
      "IncludeUserActions": ""
    },
    "ClientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "ClientApplications": {
      "ExcludeServicePrincipals": null,
      "IncludeServicePrincipals": null,
      "ServicePrincipalFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter"
    },
    "DeviceStates": {
      "ExcludeStates": null,
      "IncludeStates": null
    },
    "Devices": {
      "DeviceFilter": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessFilter",
      "ExcludeDeviceStates": null,
      "ExcludeDevices": null,
      "IncludeDeviceStates": null,
      "IncludeDevices": null
    },
    "Locations": {
      "ExcludeLocations": null,
      "IncludeLocations": null
    },
    "Platforms": {
      "ExcludePlatforms": null,
      "IncludePlatforms": null
    },
    "ServicePrincipalRiskLevels": null,
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": "a2b89a91-d113-4d94-9d17-08875130ecc1",
      "ExcludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "ExcludeRoles": "",
      "ExcludeUsers": "",
      "IncludeGroups": "",
      "IncludeGuestsOrExternalUsers": "Microsoft.Graph.Beta.PowerShell.Models.MicrosoftGraphConditionalAccessGuestsOrExternalUsers",
      "IncludeRoles": "",
      "IncludeUsers": "All"
    }
  },
  "CreatedDateTime": "2023-07-26T03:50:29.5664044Z",
  "Description": null,
  "DisplayName": "GRANT - Terms of use",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": null,
      "CombinationConfigurations": null,
      "CreatedDateTime": null,
      "Description": null,
      "DisplayName": null,
      "Id": null,
      "ModifiedDateTime": null,
      "PolicyType": null,
      "RequirementsSatisfied": null
    },
    "BuiltInControls": [],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": [
      "00361d63-8e1d-4f43-ad68-513fcddfdd20"
    ]
  },
  "Id": "485b13ff-9f66-4954-b74e-da7b8f2e243e",
  "ModifiedDateTime": "2024-02-07T00:32:41.8331606Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "ContinuousAccessEvaluation": {
      "Mode": null
    },
    "DisableResilienceDefaults": null,
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": null,
      "FrequencyInterval": null,
      "IsEnabled": null,
      "Type": null,
      "Value": null
    }
  },
  "State": "enabled",
  "AdditionalProperties": {}
},
    "aad_successful_commands": [
  "Get-MgBetaPolicyAuthorizationPolicy",
  "Get-MgBetaPolicyAuthenticationFlowPolicy",
  "Get-MgBetaPolicyExternalIdentityPolicy",
  "Get-MgBetaUser",
  "Get-MgBetaGroupLifecyclePolicy",
  "Get-MgBetaDirectorySetting",
  "Get-MgBetaPolicyAuthenticationStrengthPolicy",
  "Get-MgBetaPolicyIdentitySecurityDefaultEnforcementPolicy",
  "Get-MgBetaPolicyAuthorizationPolicy",
  "Get-MgBetaPolicyCrossTenantAccessPolicyDefault",
  "Get-MgBetaPolicyAuthenticationMethodPolicy",
  "Get-MgBetaIdentityConditionalAccessPolicy",
  "Get-MgBetaIdentityConditionalAccessPolicy",
  "Get-MgBetaIdentityConditionalAccessPolicy",
  "Get-MgBetaIdentityConditionalAccessPolicy",
  "Get-MgBetaIdentityConditionalAccessPolicy",
  "Get-MgBetaIdentityConditionalAccessPolicy",
  "Get-MgBetaIdentityConditionalAccessPolicy",
  "Get-MgBetaIdentityConditionalAccessPolicy",
  "Get-MgBetaIdentityConditionalAccessPolicy",
  "Get-MgBetaIdentityConditionalAccessPolicy"
],
    "aad_unsuccessful_commands": []
        }
